{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Mike&#39;s Site",
  "language": "en",
  "home_page_url": "http://mikepropst.com/",
  "feed_url": "http://mikepropst.com/feed/feed.json",
  "description": "Mike&#39;s blog.",
  "author": {
    "name": "Mike Propst",
    "url": "http://mikepropst.com/about-me/"
  },
  "items": [{
      "id": "http://mikepropst.com/blog/still-getting-things-done/",
      "url": "http://mikepropst.com/blog/still-getting-things-done/",
      "title": "Get things done or die trying",
      "content_html": "<p>Nerds, creatives, and knowledge workers in general seem to gravitate toward productivity schemes and methodologies. If you're anything like me, and I know some of you are because that's part of why we get along, you might jump from thing to thing over time.</p>\n<p>One of the first &quot;named&quot; systems I can remember getting into is Getting Things Done, probably through early tech blogger Merlin Mann (now perhaps more well-known as co-host of a podcast with a guy who later became &quot;Bean Dad&quot;). The system worked well for me for a while when I worked from home, freelanced, and had no kids. What Mann and others who jumped on the train might not have really grasped is that David Allen (not the guy from Gong) designed it for executives with assistants and both the time and power to lock themselves away for effectively days at a time while they did weekly reviews. The book came with a door hanger. Imagine your kid respecting a door hanger that says &quot;Weekly review in progress.&quot;</p>\n<p>Lately, I've been working with two systems that are more geared toward creative minds: the bullet journal and the second brain.</p>\n<p>A friend turned me on to the &quot;bujo&quot; after I asked about the notebook she carried everywhere. The thing that its creator, Ryder Carroll, says about it is that it's a &quot;mindfulness practice masquerading as a productivity method,&quot; and that's very true. Sitting down with a paper notebook and doing both your todos and your actual journaling is a great way to focus, be present, and stop farting around with the external for a minute. It's also great for people with focus issues or who have trouble sticking to systems, because you can just pick it back up if you flop for a while. Start journaling again where you left off. No biggie.</p>\n<p>However, I have years of notebooks stacked up and one thing they're not good at is indexing and re-accessing information and insights that you've achieved. This is where Tiago Forte's <em>Building a Second Brain</em> comes into play. The core thinking behind his system is almost the opposite of the bullet journal: It's only digital tools that can store and search in a way that enables us to truly offload a lot of data from our <em>first</em> brain.</p>\n<p>That makes a lot of sense, of course, and it's what tools like Evernote, Joplin, Roam, whatever were originally designed for — but it also brings me back home to a reason that GTD worked for me: David Allen's core slogan was &quot;If it's on your mind, it's not getting done.&quot; The second brain philosophy extends that to statements like &quot;it's not able to be accessed,&quot; &quot;it's not creative fodder,&quot; or more generally, &quot;if it's on your mind, it's not doing you any good.&quot;</p>\n<p>There's a lot more I love about the method but that's another post. But I still feel like I owe a lot to David Allen and his insane flowcharts designed to take things &quot;off your mind&quot; and turn you into a robot that always knows what to do. in this stupid-ass world where we have strayed pretty far from whatever-you-believe-in's light, it's a gift to be able to stop worrying about stuff for a few minutes.</p>\n",
      "date_published": "2023-02-28T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/blog-enters-the-21st-century/",
      "url": "http://mikepropst.com/blog/blog-enters-the-21st-century/",
      "title": "Blog enters the 21st century",
      "content_html": "<p>I don't even know what that means. I think things have gotten over-complicated, but the idea that I can write on my computer and publish using a git commit is pretty cool. So that's what I'm doing now thanks to Netlify. The barrier to posting was &quot;Do I want to do a merge with SFTP&quot; and the answer is very often &quot;nah.&quot; This is cooler, plus I can do it from multiple computers if I wanted to.</p>\n",
      "date_published": "2023-02-25T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/building-a-useful-homelab/",
      "url": "http://mikepropst.com/blog/building-a-useful-homelab/",
      "title": "Building a useful homelab",
      "content_html": "<p>A while back I started getting nervous about hosted services. Google starting to limit storage, Amazon killing off their music hosting, all of these were catalysts but a desire for privacy and a kind of old-school internet experience also drove my plans.</p>\n<p>After some semi-successful experimentation with Plex on a Raspberry Pi, I started thinking about how the same priciple could be applied to other services, like photo galleries. Turns out that not only are there a ton of self-hosted, open-source options for doing a lot of things you might want to do, most of them have been containerized to run in Docker.</p>\n<h2 id=\"the-components\" tabindex=\"-1\">The components <a class=\"direct-link\" href=\"http://mikepropst.com/blog/building-a-useful-homelab/#the-components\" aria-hidden=\"true\">#</a></h2>\n<h3 id=\"a-computer\" tabindex=\"-1\">A computer <a class=\"direct-link\" href=\"http://mikepropst.com/blog/building-a-useful-homelab/#a-computer\" aria-hidden=\"true\">#</a></h3>\n<p>My machine is not that powerful. It's a 4-core Pentium Lenovo Thinkstation with its main drive replaced with an SSD. It previously ran Mint desktop as a basic home computer. But after I got an old Macbook I didn't really need it, so it seemed like a perfect box to repurpose.</p>\n<h3 id=\"openmediavault\" tabindex=\"-1\">openmediavault <a class=\"direct-link\" href=\"http://mikepropst.com/blog/building-a-useful-homelab/#openmediavault\" aria-hidden=\"true\">#</a></h3>\n<p>Far and away the most popular operating system for these kinds of boxes is <a href=\"https://www.openmediavault.org/\">openmediavault</a>, a Debian distro with no desktop but a convenient web interface that allows even a relative dumbo like myself to mount drives and share them with services like SMB or FTP.</p>\n<h3 id=\"portainer\" tabindex=\"-1\">Portainer <a class=\"direct-link\" href=\"http://mikepropst.com/blog/building-a-useful-homelab/#portainer\" aria-hidden=\"true\">#</a></h3>\n<p>As you might imagine, the web UI of OMV makes one want to do everything via your browser. SSH is not super hard, but it's mighty convenient to use Portainer, a great web UI for Docker.</p>\n<h3 id=\"jellyfin\" tabindex=\"-1\">Jellyfin <a class=\"direct-link\" href=\"http://mikepropst.com/blog/building-a-useful-homelab/#jellyfin\" aria-hidden=\"true\">#</a></h3>\n<p>After spending what I consider to be too much money to watch my own stuff (PlexPass at $5/month), I went with <a href=\"https://jellyfin.org/\">Jellyfin</a>, an open-source fork of Emby. I tell you what, we've come a long way since the old XBMC running on an overheating computer attached directly to the TV. It has clients for our computers, iOS and Android devices, and Roku, and perhaps because it doesn't need to do transcoding for those devices, the old computer barely even has to work when streaming to two different devices.</p>\n<h3 id=\"navidrome\" tabindex=\"-1\">Navidrome <a class=\"direct-link\" href=\"http://mikepropst.com/blog/building-a-useful-homelab/#navidrome\" aria-hidden=\"true\">#</a></h3>\n<p>Music was never a strong point of Plex, though it was capable. <a href=\"https://navidrome.org/\">Navidrome</a> implements the Subsonic API, which is pretty well supported in a range of (admittedly varying-quality) third party apps, though it's better than Subsonic itself, which is Java. Is it your personal Spotify? Not quite, but close enough.</p>\n<h3 id=\"cups\" tabindex=\"-1\">CUPS <a class=\"direct-link\" href=\"http://mikepropst.com/blog/building-a-useful-homelab/#cups\" aria-hidden=\"true\">#</a></h3>\n<p>Of course, right? We have a laser printer with no built-in network capabilities, and frankly we've had better luck using this old box than a dedicated print server from Monoprice.</p>\n<h3 id=\"paperless-ngx\" tabindex=\"-1\">Paperless-ngx <a class=\"direct-link\" href=\"http://mikepropst.com/blog/building-a-useful-homelab/#paperless-ngx\" aria-hidden=\"true\">#</a></h3>\n<p>This is a really great <a href=\"https://paperless-ngx.com/\">document archive system</a> that lets you specify all kinds of great metadata for finding your stuff when you need it (say, tax time or when the insurance company asks for documentation). An iOS app scans directly into it, where the server then OCRs all documents. From there, machine learning tools start trying to automatically apply metadata based on your defined patterns of text.</p>\n<h3 id=\"duplicati\" tabindex=\"-1\">Duplicati <a class=\"direct-link\" href=\"http://mikepropst.com/blog/building-a-useful-homelab/#duplicati\" aria-hidden=\"true\">#</a></h3>\n<p>It's a GUI backup tool. Easy cheesy, and now all my stuff is backed up in Backblaze B2.</p>\n<h3 id=\"photos\" tabindex=\"-1\">Photos <a class=\"direct-link\" href=\"http://mikepropst.com/blog/building-a-useful-homelab/#photos\" aria-hidden=\"true\">#</a></h3>\n<p>This is a whole other post. What a fun and frustrating journey.</p>\n<h2 id=\"resources\" tabindex=\"-1\">Resources <a class=\"direct-link\" href=\"http://mikepropst.com/blog/building-a-useful-homelab/#resources\" aria-hidden=\"true\">#</a></h2>\n<p>It's hard to overstate the usefulness of <strong>/r/selfhosted</strong> as well as the subreddits for all the individual tools. Lots of people of varying levels of expertise willing to help.</p>\n<p>If you have any questions on how I did some of this stuff, hit me on twitter/cohost/FB/whatever and I can try to explain it in my just-enough-to-be-dangerous way.</p>\n",
      "date_published": "2023-02-12T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/rip-burt-bacharach/",
      "url": "http://mikepropst.com/blog/rip-burt-bacharach/",
      "title": "RIP Burt Bacharach",
      "content_html": "<p>Are these the only posts I write anymore? Talk about a legend right here, Burt Bacharach shuffled off at 94. I have to say that's a good run.</p>\n<p>The man, along with Hal David turned complex, jazz-derived chords and combinations into sublime, accessible pop. He collaborated with Elvis Costello and of course Dionne Warwick, among others, and inspired not just easy-listening mellow cats, but a huge range of artists that included Arthur Lee and his proto-punk band Love.</p>\n<div class=\"embed-container\"><iframe src=\"https://www.youtube.com/embed/ftO9ClIhFAo\" frameborder=\"0\" allowfullscreen=\"\"></iframe></div>\n<p>A true titan of music. Rest well and thanks for the music.</p>\n",
      "date_published": "2023-02-11T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/rip-yukihiro-takahashi/",
      "url": "http://mikepropst.com/blog/rip-yukihiro-takahashi/",
      "title": "RIP Yukihiro Takahashi",
      "content_html": "<p>This one is a little late. But here's a guy who was the vocalist and drummer of the legendary Yellow Magic Orchestra, and then — like his other two bandmates — went on to an almost equally-legendary solo discography. Like Bowie, Peter Gabriel, and Robert Fripp, Takahashi is a big inspiration on everything I do that involves &quot;songs&quot; or &quot;musicality.&quot; He never strayed away from pop or accessibility, but always kept it a little left-of-center.</p>\n<p>Here's an insanely 80s video for the title track of my favorite of his, <em>Murdered By The Music.</em></p>\n<div class=\"embed-container\"><iframe src=\"https://www.youtube.com/embed/qRs_o_9S3WU\" frameborder=\"0\" allowfullscreen=\"\"></iframe></div>",
      "date_published": "2023-02-03T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/in-praise-of-jellyfin-so-far/",
      "url": "http://mikepropst.com/blog/in-praise-of-jellyfin-so-far/",
      "title": "In praise of Jellyfin (so far)",
      "content_html": "<p>Lately I've been doing more fighting with Plex (slogan: &quot;Pay $5 a month to use your own server&quot;) and my Raspberry Pi-based media server than actually watching or listening anything, so I tried a few new things.</p>\n<ul>\n<li>I repurposed a desktop that I hadn't been using since getting a 2015 Macbook that was just a place to randomly try new distros and desktop environments for no reason.</li>\n<li>I put Openmediavault (the OS) on it, and slapped a Dockerized Jellyfin in there.</li>\n<li>I added Tailscale to the equation so I could get there from the other end of the house (don't ask, our house is bad at internet) or from outside the house.</li>\n</ul>\n<p>Unfortunately, Tailscale doesn't let Roku type devices get on my tunnel, so maybe I'll use the old Pi for some kind of perma-VPN or reverse proxy or some shit I clearly do not understand.</p>\n<p>But I've found Jellyfin to be more bare-bones yet also much more performant, more likely to direct stream than attempt to transcode, and really a breeze to work with. If you've ever wondered about switching from Plex, it might be for you. If you are wondering about Emby, don't — Jellyfin is an open-sourced fork that is more up to date.</p>\n",
      "date_published": "2023-01-10T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/music-i-liked-in-2022/",
      "url": "http://mikepropst.com/blog/music-i-liked-in-2022/",
      "title": "Music I liked in 2022",
      "content_html": "<p>I always do this, but honestly it was not a huge year for me in terms of listening to new music. I'm still jamming Necrot's <em>Mortal</em> (2020) on the regular and couldn't tell you much about what new death metal is out there. And two of my favorite bands were cut down by tragedy: Low due to Mimi Parker's untimely death from cancer, and Neurosis from the revelation that Scott Kelly was an abusive sociopath.</p>\n<ul>\n<li>Sky Pig - <em>It Thrives In Darkness</em></li>\n<li>Petbrick - <em>Liminal</em></li>\n<li>Blut Aus Nord - <em>Disharmonium - Undreamable Abysses</em></li>\n<li>Lykotonon - <em>Promethean Pathology</em></li>\n<li>Hissing - <em>Hypervirulence Architecture</em></li>\n<li>ADULT. - <em>Becoming Undone</em></li>\n<li>Nik Colk Void - <em>Bucked up Space</em></li>\n<li>Wet Leg - <em>Wet Leg</em> (I'm still hip!)</li>\n<li>Jóhann Jóhannsson - <em>Drone Mass</em> (this is mostly here because it exists. It's a gift to have more Jóhann after his death)</li>\n<li>Locrian - <em>New Catastrophism</em></li>\n<li>Vermin Womb - <em>Retaliation</em></li>\n<li>Primitive Man - <em>Insurmountable</em></li>\n<li>Undeath - <em>It's Time... To Rise From The Grave</em></li>\n<li>Hällas - <em>Isle of WIsdom</em></li>\n<li>KEN Mode - <em>NULL</em></li>\n<li>Conjurer - <em>Pathos</em></li>\n<li>Crowbar - <em>Zero and Below</em> (It's Crowbar... come on)</li>\n<li>Orthodox - <em>Proceed</em></li>\n<li>Vanum - <em>Legend</em></li>\n</ul>\n<p>That was in no particular order, but I think the top spot is occupied by Haunted Horses' <em>The Worst Has Finally Happened</em>. Monstrous and unique. It does the things I like. Check it out.</p>\n",
      "date_published": "2023-01-05T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/deaths-in-2022/",
      "url": "http://mikepropst.com/blog/deaths-in-2022/",
      "title": "Real ones we lost in 2022",
      "content_html": "<p>If the memes and jokes are to be believed, 2022 wasn't any more of a picnic than any year since the pandemic started. Or since 2015 maybe. Or the century. Or eternity maybe. But truly, we did lose some real ones in the music world.</p>\n<p>If you haven't heard of any of these folks, I suggest you check them out. There's a lot of great art here.</p>\n<ul>\n<li><strong>Terry Hall.</strong> The last one of the year to go that I noticed, the <a href=\"http://mikepropst.com/blog/rip-terry-hall/\">Specials singer</a> was a big loss to my musical history.</li>\n<li><strong>Keith Levine.</strong> I was a little late to PiL, but so many of the guitarists I admire, like Daniel Ash, owe a ton to him. His work on <em>Metal Box</em> still blows me away.</li>\n<li><strong>D.H. Peligro.</strong> An incredible drummer for one of the greats in hardcore, and one of the few and the proud who proved that punk wasn't just white guys and Bad Brains.</li>\n<li><strong>Jerry Lee Lewis.</strong> What can you say about the Killer that hasn't been said? Not the original wild man of rock and roll, but an early trash fire who paved the way for many more. Still energizing to listen to.</li>\n<li><strong>Pharaoh Sanders.</strong> One of the few jazz guys I really get into. Truly expanding stuff.</li>\n<li><strong>Andy Fletcher.</strong> Depeche Mode was an early expansion into electronic music for me, and probably half the known universe too.</li>\n<li><strong>Mark Lanegan.</strong> One of those guys who seemed to court death for a long time before they finally hooked up. A great lyricist and so unsung in the world of Seattle music.</li>\n<li><strong>Rachel Nagy.</strong> I think I only saw the Detroit Cobras once when I lived there, but they were legendary. Too young, and I still haven't heard what happened.</li>\n<li><strong>Vangelis.</strong> I was never a huge fan, but it's safe to say in hindsight he's one of the people who introduced me to electronic music. Maybe Jarre had more influence on me, but only because he came later — and because Vangelis's &quot;Chariots of Fire&quot; was so omnipresent.</li>\n<li><strong>Lamont Dozier, Dennis Waterman, Ken WIlliams.</strong> You might not know these names. Look them up. That's a lot of firepower lost. These are guys with both art and craft, guys whose results are very difficult to argue with.</li>\n<li><strong>Klaus Schulze.</strong> Up until relatively recently, I knew him mostly from the first Tangerine Dream album and Ash Ra Tempel, but even that'd be enough to cement him in my mind as one of the greats. But then there's <em>Timewind,</em> <em>Angst,</em> and a billion other releases. A master.</li>\n<li><strong>The big hoedown in the sky.</strong> Country was hit hard in '22. C.W. McCall might've been a one-hit wonder (&quot;Convoy&quot;) but it was a monster and it always makes me think of my uncle who knew every word and maybe still does. Then Mickey Gilly, Naomi Judd, and Loretta Lynn? All pioneers and legends.</li>\n<li><strong>Classic rock radio.</strong> Dan McCafferty of Nazareth, Wilko Johnson of Dr. Feelgood, Christine McVee, Meat Loaf. Can't say I'm necessarily a fan of any of them, but their stature was undeniable. And of course, there's Meat's masterful performance in <em>Fight Club.</em></li>\n<li><strong>Coolio.</strong> It's fucking Coolio. How is Coolio gone?</li>\n<li><strong>Taylor Hawkins.</strong> The Foos are not one of my favorites either, but it sure seems to me that he was loved by pretty much everyone who came across him.</li>\n<li><strong>The lords of the synth.</strong> This year we lost both John Appleton, the inventor of the Synclavier, and <a href=\"http://mikepropst.com/blog/rip-dave-smith/\">Dave Smith</a>, the man behind Sequential Circuits and one half of the pair responsible for MIDI.</li>\n<li><strong>Ronnie Spector.</strong> Between her and Lamont Dozier both leaving the building, a massive chunk of Motown is gone. No disrespect to Diana Ross but Ronnie was always my favorite.</li>\n<li><strong>Angelo Badalamenti and Julee Cruise.</strong> This is some serious garmonbozia. <a href=\"http://mikepropst.com/blog/angelo/\">Angelo</a> had a good run at least, but I was hoping to hear more from him.</li>\n<li><strong>Mimi Parker.</strong> Saved the hardest for last. I truly don't know what to say about this one. So here's a video.</li>\n</ul>\n<div class=\"embed-container\"><iframe src=\"https://www.youtube.com/embed/gBtJpVY7NkE\" frameborder=\"0\" allowfullscreen=\"\"></iframe></div>\n",
      "date_published": "2023-01-04T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/rip-terry-hall/",
      "url": "http://mikepropst.com/blog/rip-terry-hall/",
      "title": "RIP Terry Hall",
      "content_html": "<p>I feel like I've been posting a lot of these RIP things lately. The Specials were, in hindsight a big deal for me. Ska was a sound that was punk-approved. And other than hip-hop, it was the first music I got into on my own that wasn't &quot;loud guitar music.&quot; That certainly opened up the way for so many of the things I love, from James Brown to Autechre. Arguably the only band <em>more</em> important for my branching-out was Joy Division.</p>\n<p>And I can't get enough of watching them play in their heyday. They looked impossibly cool, a wild mass of energy and high pants cuffs. And there was Terry Hall at the center, totally serious and almost menacing while chaos erupted.</p>\n<p>The guy had a terrible life story with great pain in his childhood, but he translated that into a great thoughtfulness and empathy for the less fortunate in the Thatcher era. It was through him that the great contrast of the Specials — fun Jamaican-inspired music with black-humor or straight-up dark punk lyrics — manifested, and without him they've been only half of their glory.</p>\n<p>Instead of a classic Special song, here's the video for &quot;Our Lips Are Sealed,&quot; which Hall cowrote, and in which he looks like Robert Smith.</p>\n<div class=\"embed-container\"><iframe src=\"https://www.youtube.com/embed/QhVhK-VVeXo\" frameborder=\"0\" allowfullscreen=\"\"></iframe></div>",
      "date_published": "2022-12-21T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/i-cant-have-nice-things.md/",
      "url": "http://mikepropst.com/blog/i-cant-have-nice-things.md/",
      "title": "I can&#39;t have nice things",
      "content_html": "<p>Yes, Lite XL happened this year and it's been great on Linux but is a little janky on Mac. So I've stuck with what I know, which is the electron-based Atom by Github. Imagine my surprise when I went to make a couple CSS tweaks to this site today and found that Atom will be sunset... tomorrow.</p>\n<p>So here I am with VSCodium, the MS-telemetry-free version of their VS Code. I'd like to take the opportunity to try something that isn't electron (even though a text editor for web projects might be the most logical use of the technology), but I need to get some requisite Python tools to make CudaText work and the list is actually pretty short these days. Seems that if you have the money for Sublime you're using it, and if you don't you're on VS Code. Oh well.</p>\n",
      "date_published": "2022-12-14T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/angelo/",
      "url": "http://mikepropst.com/blog/angelo/",
      "title": "RIP Angelo Badalamenti",
      "content_html": "<p>First Julee Cruise, now Angelo Badalamenti. One was estranged, one was presumably still a close friend. But either way, the David Lynch musical universe is a silent place now.</p>\n<p>Here's the maestro talking about building perhaps his most iconic piece, <em>Laura Palmer's Theme.</em></p>\n<div class=\"embed-container\"><iframe src=\"https://www.youtube.com/embed/e-eqgr_gn4k\" frameborder=\"0\" allowfullscreen=\"\"></iframe></div>\n<p>Rest well and thanks for the music.</p>\n",
      "date_published": "2022-12-13T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/in-defense-of-the-novation-circuits/",
      "url": "http://mikepropst.com/blog/in-defense-of-the-novation-circuits/",
      "title": "In Praise and Defense of the Novation Circuits",
      "content_html": "<p>Pretty regularly on the Novation Circuit subreddit, a <a href=\"https://www.reddit.com/r/novationcircuit/comments/zhzbmc/next_hardware_steps_from_tracks_rhythm/\">question like this</a> or a comment expressing the same general idea appears. I'm not familiar with any other music gear subs where the users are so often actively trying to get away from their chosen devices.</p>\n<p>The Circuit OG/Tracks/Rhythm are very interesting devices. Novation took the success of the Launchpad, an Ableton clip launch controller, and expanded it into a standalone device that really isn't like anything else. There's no screen. The pad grid serves as the user feedback for every function: step sequencing, keyboard, pattern launching, mixing, even the tempo display. That makes it a device that sometimes needs a great deal of memorizing (or RTFM, initially). But it also makes it a device that absolutely nails what it means to be <em>immediate</em> and <em>tactile</em> — attributes that screen-poisoned musicians supposedly crave these days when they step away from the DAW. There's no clicking, no menu diving, no using a scroll wheel to name a pattern. There's you, there's the buttons and knobs, and there's the music. And trust me, it's extremely quick to get to the &quot;music&quot; step. Features of both current-gen Circuits include one-button &quot;scene&quot; launching, sequencer probability and random mutation, pattern chaining for very long variations, and really usable reverb and delay.</p>\n<p>So why does everyone think they need to &quot;upgrade&quot; to an Elektron machine, an MPC, or god forbid a Roland MC-707?</p>\n<h2 id=\"cheap\" tabindex=\"-1\">Cheap... <a class=\"direct-link\" href=\"http://mikepropst.com/blog/in-defense-of-the-novation-circuits/#cheap\" aria-hidden=\"true\">#</a></h2>\n<p>Firstly, these things are not expensive. About $350 gets you a new one, and for better or worse this &quot;gotta upgrade&quot; attitude leaves Reverb stocked with them for much less. I think there's an attitude with all kinds of musicians that the more you spend, the better your stuff is. Surprise! That's bullshit. It's not that I'm that old blues lawyer guitarist insisting that &quot;tone is in the fingers&quot; — after all, these same people are connecting 1958 Les Pauls to Dumble amps via Monster cables.</p>\n<p>What I mean is electronic musical instruments are very rarely apples-to-apples comparisons. They all have their strengths and their frustrations. And good stuff has never been cheaper than it is right now.</p>\n<h2 id=\"and-unspecialized\" tabindex=\"-1\">And unspecialized... <a class=\"direct-link\" href=\"http://mikepropst.com/blog/in-defense-of-the-novation-circuits/#and-unspecialized\" aria-hidden=\"true\">#</a></h2>\n<p>The second thing is that, possibly because of said price, no pros have decided that these things have a certain space. If you want to make hard techno or dancey industrial, people like NIN and Richard Devine have sold you on Elektron machines and their hyped, exciter-pumped sounds. If you make lo-fi or boom bap, you want an SP-404 because Madlib, J Dilla, Flying Lotus, and who knows who else used one to make their iconic material. Even doofy gear gets this treatment at times, like the really uninspiring Microkorg being anointed the &quot;synth for an indie rock band that has a synth.&quot;</p>\n<p>What is the Circuit's space? It doesn't have one. I wouldn't say it's a &quot;master of none&quot; because it's quite good at plenty of things, but looking at it you don't say &quot;ah yes, this thing is for X.&quot;</p>\n<iframe id=\"reddit-embed\" src=\"https://www.redditmedia.com/r/novationcircuit/comments/vgvqt2/first_composition_with_both_tracks_and_rhythm/?ref_source=embed&amp;ref=share&amp;embed=true&amp;theme=dark\" sandbox=\"allow-scripts allow-same-origin allow-popups\" style=\"border: none;\" scrolling=\"no\" width=\"100%\" height=\"auto\"></iframe>\n<h2 id=\"just-like-me\" tabindex=\"-1\">Just like me. <a class=\"direct-link\" href=\"http://mikepropst.com/blog/in-defense-of-the-novation-circuits/#just-like-me\" aria-hidden=\"true\">#</a></h2>\n<p>What I can say about the Circuits, especially the Circuit Tracks, is that they are now my centerpiece for both performing and composing, and in 20+ years of making live electronic music I have not owned another machine that enabled my way of working so thoroughly.</p>\n<p>Would I like more precise sample cutting onboard? Yeah probably. What about separate outputs? Always want those. But &quot;missing&quot; features like these imply that the very purposeful design of these devices somehow includes more mistakes than it actually does. And the sum of the features versus tradeoffs is unlike anything else out there for both utility and (<em>gasp</em>) fun. So I'm not sure that an upgrade would actually be one at all.</p>\n",
      "date_published": "2022-12-12T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/witchin/",
      "url": "http://mikepropst.com/blog/witchin/",
      "title": "Witchin&#39;",
      "content_html": "<p>Partially because there have been vast swathes of my life that went un-gamed, and partially because I have only kept a nintendo console around for quite a few years now, I tend to get into games late. My latest to finally add to the pile was <em>The Witcher III: Wild Hunt</em>, the main storyline of which I finished today, probably prematurely due to a week of being sick.</p>\n<h2 id=\"openness\" tabindex=\"-1\">Openness <a class=\"direct-link\" href=\"http://mikepropst.com/blog/witchin/#openness\" aria-hidden=\"true\">#</a></h2>\n<p>Holy shit it's a lot of game. And unlike Skyrim, you can go just about anywhere. Nobody climbs like Link, but Geralt does a good job of getting around territory. At least until he dies of falling from any height greater than 6 feet.</p>\n<h2 id=\"combat\" tabindex=\"-1\">Combat <a class=\"direct-link\" href=\"http://mikepropst.com/blog/witchin/#combat\" aria-hidden=\"true\">#</a></h2>\n<p>Like most 3d action RPGs, you can either parry or dodge-and-roll your way through combat. And as with all the rest, I take the latter path (arguably blocking is better since a perfect parry almost always gets you a nice opening — probably just one of the many reasons I'm shit at <em>Souls</em>). But either way the combat is a lot of fun. Much like Link's runes or a weapon/destruction hybrid build in Skyrim, the weapon and magic combo is really satisfying and gives combat a lot of variety. Geralt is a little slower to act than say, Link, but you get his timing down and you feel unstoppable.</p>\n<h2 id=\"using-mechanics-to-tell-the-story\" tabindex=\"-1\">Using mechanics to tell the story <a class=\"direct-link\" href=\"http://mikepropst.com/blog/witchin/#using-mechanics-to-tell-the-story\" aria-hidden=\"true\">#</a></h2>\n<p>I really think one the bar to hit here is <em>Nier: Automata</em>, but W3 does a great job sporadically. Playing as Ciri in flashback (or her supremely overpowered moment near the end, one-hitting wild hunt warriors) is a fun mix-up that lets you &quot;live&quot; the story a bit more. With a few exceptions, I have very little idea what the dialog options did to my playthrough and that's kinda cool. I guess it's a choice-mechanic equivalent of the open world.</p>\n<h2 id=\"bummers\" tabindex=\"-1\">Bummers <a class=\"direct-link\" href=\"http://mikepropst.com/blog/witchin/#bummers\" aria-hidden=\"true\">#</a></h2>\n<p>Like I said, something about the linear story that's very cleverly woven into an open-world game left me feeling &quot;done&quot; when it resolved. And I know there's a lot more there I haven't done.</p>\n<p>Load times are really unfortunate, at least on the Switch. In story-heavy sections, there's a lot of it. Fast travel feels not all that fast when you can sometimes ride your horse there faster.</p>\n<p>Frame rate is not great. <em>Automata</em> is a newer game that feels really intensive, but it rarely got herky-jerky. When it rains in a busy place like Novigrad (which is often), Geralt starts doing the robot. Weirder and more distracting is the crappy framerate in some cut scenes. In a game with so many of them, it's unfortunate.</p>\n<p>None of this impeding me enjoying the shit out of it. Even the fall damage thing, because I laughed my ass off every time Geralt died by tripping over a rock.</p>\n",
      "date_published": "2022-12-08T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/is-this-really-it/",
      "url": "http://mikepropst.com/blog/is-this-really-it/",
      "title": "Is this really it?",
      "content_html": "<p>The number of occasions I've heard masses of people say they're going to walk away from Twitter now numbers in the dozens over the years. The company has demonstrated contempt for the users that can be rivaled only by Meta, having pivoted many years ago from adding features based on usage (<em>Retweets</em>) to generally delivering weird non-features that even the advertisers don't really want (<em>Blue</em>).</p>\n<p>But now it's being bought by a guy who has latched onto the &quot;free speech brigade&quot; not because he's particularly pro-free-speech (he's not), or because his politics align with those kinds of people (they do), but because he seems dumb enough to believe their spiel (he might be). A union-buster, an apartheid-profiter, and a guy who has used the platform that will soon be his to:</p>\n<ul>\n<li>Get yelled at by a Wachowski</li>\n<li>Libel the guy who saved that Thai sports team after nobody liked his coffin submarine idea</li>\n<li>Predict the end of COVID-19 with the accuracy of Nate Silver picking numbers out of a hat</li>\n<li>Generally sound like a dumbass who'd be cringey and goofy if he wasn't so simultaneously powerful</li>\n</ul>\n<p>Anyway. Doesn't bode all that well. Maybe it's time.</p>\n<p>What is Cohost? I dunno. Probably another thing that'll come and go quickly. I still get spam emails from Ello, the supposed Facebook-killer that was all in black-and-white Courier font and whose name I had to look up.</p>\n<p>I don't know how to Mastodon despite being acquainted with its founder and signing up for many servers over the years. Somehow the email model of &quot;different servers but everyone can talk&quot; fails to make sense to me in a social media context.</p>\n<p>But I use Twitter less and less every year, and these days even the months show decline. And maybe it's time for us all to stop trying to post through it anyway.</p>\n",
      "date_published": "2022-10-27T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/one-year-with-obsidian/",
      "url": "http://mikepropst.com/blog/one-year-with-obsidian/",
      "title": "One year with Obsidian",
      "content_html": "<p>It occurs to me that I wrote this <a href=\"http://mikepropst.com/blog/a-better-way-to-keep-notes/\">post about trying Obsidian</a> about a year ago. In that time, I have not really strayed from it, which is pretty unusual for me. I get really restless with tools. Thanks to a very active plugin community, theme ecosystem, and subreddit, it's become a great tool that is super customizable. I adapted a few times and that was no biggie at all thanks to the fact that Obsidian is based entirely around discrete files, stored in your file system, with their own regular ol' file names.</p>\n<p>My current way of operating is shamefully trendy; I'm using Tiago Forte's <em>Building a Second Brain</em> as the methodology. One reason is that it works reasonably well with other tools including paper journaling and <a href=\"https://raindrop.io/\">Raindrop</a> bookmarks. Though he apparently uses Evernote and swears by its search (which is still quite good despite Evernote's many problems), I think the linking features in Obsidian are really what makes it good for this system. Knowledge doesn't just go in a filing cabinet and get dusty. You can always see it thanks to links and unlinked mentions.</p>\n<p>I'm still not interested in changing, and as long as I am still locked into the old $5 rate for syncing, I will keep that as well.</p>\n",
      "date_published": "2022-08-10T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/",
      "url": "http://mikepropst.com/blog/",
      "title": "",
      "content_html": "\n\n<h1>Blog</h1>\n<div class=\"post__body\">\n  \n  \n  <ul class=\"postlist\">\n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/still-getting-things-done/\" class=\"postlist-link\">Get things done or die trying</a>\n    <time class=\"postlist-date\" datetime=\"2023-02-28\">Feb 28, 2023</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/blog-enters-the-21st-century/\" class=\"postlist-link\">Blog enters the 21st century</a>\n    <time class=\"postlist-date\" datetime=\"2023-02-25\">Feb 25, 2023</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/building-a-useful-homelab/\" class=\"postlist-link\">Building a useful homelab</a>\n    <time class=\"postlist-date\" datetime=\"2023-02-12\">Feb 12, 2023</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/rip-burt-bacharach/\" class=\"postlist-link\">RIP Burt Bacharach</a>\n    <time class=\"postlist-date\" datetime=\"2023-02-11\">Feb 11, 2023</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/rip-yukihiro-takahashi/\" class=\"postlist-link\">RIP Yukihiro Takahashi</a>\n    <time class=\"postlist-date\" datetime=\"2023-02-03\">Feb 3, 2023</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/in-praise-of-jellyfin-so-far/\" class=\"postlist-link\">In praise of Jellyfin (so far)</a>\n    <time class=\"postlist-date\" datetime=\"2023-01-10\">Jan 10, 2023</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/music-i-liked-in-2022/\" class=\"postlist-link\">Music I liked in 2022</a>\n    <time class=\"postlist-date\" datetime=\"2023-01-05\">Jan 5, 2023</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/deaths-in-2022/\" class=\"postlist-link\">Real ones we lost in 2022</a>\n    <time class=\"postlist-date\" datetime=\"2023-01-04\">Jan 4, 2023</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/rip-terry-hall/\" class=\"postlist-link\">RIP Terry Hall</a>\n    <time class=\"postlist-date\" datetime=\"2022-12-21\">Dec 21, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/i-cant-have-nice-things.md/\" class=\"postlist-link\">I can&#39;t have nice things</a>\n    <time class=\"postlist-date\" datetime=\"2022-12-14\">Dec 14, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/angelo/\" class=\"postlist-link\">RIP Angelo Badalamenti</a>\n    <time class=\"postlist-date\" datetime=\"2022-12-13\">Dec 13, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/in-defense-of-the-novation-circuits/\" class=\"postlist-link\">In Praise and Defense of the Novation Circuits</a>\n    <time class=\"postlist-date\" datetime=\"2022-12-12\">Dec 12, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/witchin/\" class=\"postlist-link\">Witchin&#39;</a>\n    <time class=\"postlist-date\" datetime=\"2022-12-08\">Dec 8, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/is-this-really-it/\" class=\"postlist-link\">Is this really it?</a>\n    <time class=\"postlist-date\" datetime=\"2022-10-27\">Oct 27, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/one-year-with-obsidian/\" class=\"postlist-link\">One year with Obsidian</a>\n    <time class=\"postlist-date\" datetime=\"2022-08-10\">Aug 10, 2022</time>\n  </li>\n  \n\n\n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/whoops/\" class=\"postlist-link\">Whoops</a>\n    <time class=\"postlist-date\" datetime=\"2022-08-08\">Aug 8, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/disappointing/\" class=\"postlist-link\">Disappointing</a>\n    <time class=\"postlist-date\" datetime=\"2022-07-26\">Jul 26, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/dark-days-ahead/\" class=\"postlist-link\">Dark days ahead</a>\n    <time class=\"postlist-date\" datetime=\"2022-06-26\">Jun 26, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/rip-julee-cruise/\" class=\"postlist-link\">RIP Julee Cruise</a>\n    <time class=\"postlist-date\" datetime=\"2022-06-11\">Jun 11, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/rip-dave-smith/\" class=\"postlist-link\">RIP Dave Smith</a>\n    <time class=\"postlist-date\" datetime=\"2022-06-03\">Jun 3, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/yes-virginia-there-is-a-microsoft-version-of-that/\" class=\"postlist-link\">Yes, Virginia, there is a Microsoft version of that</a>\n    <time class=\"postlist-date\" datetime=\"2022-05-09\">May 9, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/lite-xl/\" class=\"postlist-link\">Lite XL</a>\n    <time class=\"postlist-date\" datetime=\"2022-04-23\">Apr 23, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/yes-this-etc/\" class=\"postlist-link\">Yes, this, etc.</a>\n    <time class=\"postlist-date\" datetime=\"2022-04-22\">Apr 22, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/365-days-of-type/\" class=\"postlist-link\">365 days of type 9 from TRUF</a>\n    <time class=\"postlist-date\" datetime=\"2022-04-19\">Apr 19, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/another-day-another-blog-redesign/\" class=\"postlist-link\">Another day, another blog redesign</a>\n    <time class=\"postlist-date\" datetime=\"2022-04-13\">Apr 13, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/utopian-thinking/\" class=\"postlist-link\">Utopian thinking</a>\n    <time class=\"postlist-date\" datetime=\"2022-04-06\">Apr 6, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/the-fbi-guide-to-internet-slang/\" class=\"postlist-link\">The FBI Guide to Internet Slang</a>\n    <time class=\"postlist-date\" datetime=\"2022-03-25\">Mar 25, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/problems-i-m-glad-im-not-dealing-with/\" class=\"postlist-link\">Problems I&#39;m glad I&#39;m not dealing with</a>\n    <time class=\"postlist-date\" datetime=\"2022-03-22\">Mar 22, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/is-this-it/\" class=\"postlist-link\">Is this it?</a>\n    <time class=\"postlist-date\" datetime=\"2022-03-10\">Mar 10, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/i-salute-you-mmt-8/\" class=\"postlist-link\">I salute you, MMT-8</a>\n    <time class=\"postlist-date\" datetime=\"2022-03-03\">Mar 3, 2022</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/bob-moog-and-usability-heuristics/\" class=\"postlist-link\">Bob Moog and usability heuristics</a>\n    <time class=\"postlist-date\" datetime=\"2021-08-10\">Aug 10, 2021</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/a-better-way-to-keep-notes/\" class=\"postlist-link\">A better way to keep notes</a>\n    <time class=\"postlist-date\" datetime=\"2021-08-02\">Aug 2, 2021</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/figma-organization-for-busy-designers/\" class=\"postlist-link\">Figma organization for busy designers</a>\n    <time class=\"postlist-date\" datetime=\"2021-05-24\">May 24, 2021</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/typora-for-windows/\" class=\"postlist-link\">Typora for Windows</a>\n    <time class=\"postlist-date\" datetime=\"2021-05-05\">May 5, 2021</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/the-great-un-googling/\" class=\"postlist-link\">The great un-googling</a>\n    <time class=\"postlist-date\" datetime=\"2021-04-25\">Apr 25, 2021</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/new-device-behringer-td-3/\" class=\"postlist-link\">New device: Behringer TD-3</a>\n    <time class=\"postlist-date\" datetime=\"2021-04-25\">Apr 25, 2021</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/adee-figma-a11y-testing-tool/\" class=\"postlist-link\">Adee - Figma a11y testing tool</a>\n    <time class=\"postlist-date\" datetime=\"2021-03-29\">Mar 29, 2021</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/creating-music-during-the-pandemic/\" class=\"postlist-link\">Creating music during the pandemic</a>\n    <time class=\"postlist-date\" datetime=\"2021-03-20\">Mar 20, 2021</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/cranking-the-engine-back-up/\" class=\"postlist-link\">Cranking the engine back up</a>\n    <time class=\"postlist-date\" datetime=\"2021-03-20\">Mar 20, 2021</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/can-ux-be-remote/\" class=\"postlist-link\">Can UX be remote?</a>\n    <time class=\"postlist-date\" datetime=\"2020-04-13\">Apr 13, 2020</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/boring-gear-post-pedalboard-layout/\" class=\"postlist-link\">Boring gear post (pedalboard layout</a>\n    <time class=\"postlist-date\" datetime=\"2019-07-15\">Jul 15, 2019</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/when-you-have-to-do-a-focus-group/\" class=\"postlist-link\">When you &quot;have&quot; to do a focus group</a>\n    <time class=\"postlist-date\" datetime=\"2019-04-04\">Apr 4, 2019</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/scott/\" class=\"postlist-link\">Scott</a>\n    <time class=\"postlist-date\" datetime=\"2019-03-25\">Mar 25, 2019</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/hopefully-the-last-word-on-design-thinking/\" class=\"postlist-link\">Hopefully The Last Word on Design Thinking</a>\n    <time class=\"postlist-date\" datetime=\"2018-12-18\">Dec 18, 2018</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/programming-css/\" class=\"postlist-link\">Programming CSS</a>\n    <time class=\"postlist-date\" datetime=\"2018-12-17\">Dec 17, 2018</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/ideo-responds/\" class=\"postlist-link\">IDEO responds</a>\n    <time class=\"postlist-date\" datetime=\"2018-10-31\">Oct 31, 2018</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/pure-framework/\" class=\"postlist-link\">PURE Framework</a>\n    <time class=\"postlist-date\" datetime=\"2018-10-16\">Oct 16, 2018</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/design-thinking-considered-harmful/\" class=\"postlist-link\">Design Thinking Considered Harmful</a>\n    <time class=\"postlist-date\" datetime=\"2018-10-09\">Oct 9, 2018</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/familytronica/\" class=\"postlist-link\">Familytronica</a>\n    <time class=\"postlist-date\" datetime=\"2018-08-22\">Aug 22, 2018</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/making-heroes/\" class=\"postlist-link\">Making Heroes</a>\n    <time class=\"postlist-date\" datetime=\"2018-07-14\">Jul 14, 2018</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/synthesizin/\" class=\"postlist-link\">Synthesizin&#39;</a>\n    <time class=\"postlist-date\" datetime=\"2018-04-10\">Apr 10, 2018</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/reapin/\" class=\"postlist-link\">Reapin&#39;</a>\n    <time class=\"postlist-date\" datetime=\"2017-11-08\">Nov 8, 2017</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/no-need-for-abstraction-layers-with-css-grid/\" class=\"postlist-link\">No need for an abstraction layer with CSS Grid</a>\n    <time class=\"postlist-date\" datetime=\"2017-10-30\">Oct 30, 2017</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/the-golden-age-of-ux/\" class=\"postlist-link\">Is the golden age of UX really over, and what does that really mean</a>\n    <time class=\"postlist-date\" datetime=\"2017-08-24\">Aug 24, 2017</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/on-mistral/\" class=\"postlist-link\">On Mistral</a>\n    <time class=\"postlist-date\" datetime=\"2017-08-01\">Aug 1, 2017</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/stealing-your-way-to-original-design/\" class=\"postlist-link\">Stealing your way to original design with Dan Mall</a>\n    <time class=\"postlist-date\" datetime=\"2017-07-05\">Jul 5, 2017</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/inline-validation-considered-harmful/\" class=\"postlist-link\">Inline validation considered harmful</a>\n    <time class=\"postlist-date\" datetime=\"2017-06-28\">Jun 28, 2017</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/type-on-the-web/\" class=\"postlist-link\">Type on the web</a>\n    <time class=\"postlist-date\" datetime=\"2017-06-11\">Jun 11, 2017</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/juicero-teardown/\" class=\"postlist-link\">Juicero teardown</a>\n    <time class=\"postlist-date\" datetime=\"2017-05-01\">May 1, 2017</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/switching-to-studio-one/\" class=\"postlist-link\">Switching to Studio One</a>\n    <time class=\"postlist-date\" datetime=\"2017-03-23\">Mar 23, 2017</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/ikea-hacking-for-the-studio/\" class=\"postlist-link\">IKEA hacking for the studio</a>\n    <time class=\"postlist-date\" datetime=\"2017-03-23\">Mar 23, 2017</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/linting-html-with-css/\" class=\"postlist-link\">Linting HTML with CSS</a>\n    <time class=\"postlist-date\" datetime=\"2017-03-14\">Mar 14, 2017</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/its-grid-time/\" class=\"postlist-link\">It&#39;s grid time!</a>\n    <time class=\"postlist-date\" datetime=\"2017-03-13\">Mar 13, 2017</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/front-end-styleguides-by-anna-debenham/\" class=\"postlist-link\">Front End Style Guides by Anna Debenham</a>\n    <time class=\"postlist-date\" datetime=\"2017-01-13\">Jan 13, 2017</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/people-are-bad-at-computers/\" class=\"postlist-link\">Nielsen: Computer skills are worse than you think</a>\n    <time class=\"postlist-date\" datetime=\"2016-11-21\">Nov 21, 2016</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/japanese-logos/\" class=\"postlist-link\">Japanese logos</a>\n    <time class=\"postlist-date\" datetime=\"2016-11-04\">Nov 4, 2016</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/disenfranchised-by-bad-design/\" class=\"postlist-link\">Disenfranchised by bad design</a>\n    <time class=\"postlist-date\" datetime=\"2016-10-24\">Oct 24, 2016</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/when-to-use-you-and-me-in-a-user-interface/\" class=\"postlist-link\">When to use &quot;me&quot; and &quot;you&quot; in a user interface</a>\n    <time class=\"postlist-date\" datetime=\"2016-08-13\">Aug 13, 2016</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/dont-do-it-no-2137/\" class=\"postlist-link\">Don&#39;t Do It, No. 2137</a>\n    <time class=\"postlist-date\" datetime=\"2016-08-01\">Aug 1, 2016</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/ignore-some-user-feedback/\" class=\"postlist-link\">Ignore (some) user feedback</a>\n    <time class=\"postlist-date\" datetime=\"2016-07-15\">Jul 15, 2016</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/to-icon-or-not-to-icon/\" class=\"postlist-link\">To icon or not to icon</a>\n    <time class=\"postlist-date\" datetime=\"2016-06-10\">Jun 10, 2016</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/meaningful-css/\" class=\"postlist-link\">Meaningful CSS (Basically, what he said)</a>\n    <time class=\"postlist-date\" datetime=\"2016-05-25\">May 25, 2016</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/semantics-vs-objects/\" class=\"postlist-link\">Semantics vs Objects and other scary CSS animals</a>\n    <time class=\"postlist-date\" datetime=\"2016-05-18\">May 18, 2016</time>\n  </li>\n  \n\n\n  <li class=\"postlist-item\">\n    <a href=\"http://mikepropst.com/blog/new-impercept-ep/\" class=\"postlist-link\">New Impercept EP</a>\n    <time class=\"postlist-date\" datetime=\"2016-03-28\">Mar 28, 2016</time>\n  </li>\n  \n\n</ul>\n\n</div>\n",
      "date_published": "2022-08-08T20:44:29Z"
    },{
      "id": "http://mikepropst.com/blog/whoops/",
      "url": "http://mikepropst.com/blog/whoops/",
      "title": "Whoops",
      "content_html": "<p>When moving site hosts to save a buck I seem to have screwed some things up. I'm not interested in paying for a new Kirby license so I'm trying a static site generator (<a href=\"https://www.11ty.dev/\">Eleventy</a>). Unfortunately, as much as I was able to do some bulk text conversion, I'm just not an expert at that stuff. For everything I love about Kirby, it unfortunately does not store all the page data in frontmatter like almost every other CMS or site generator. So it's been a bit of a pain.</p>\n<p>The upshot: even compared to Kirby or Grav or whatever, this thing should be <em>fast.</em></p>\n<p>TODO:</p>\n<ul>\n<li>Relocate older posts</li>\n<li>Recreate the old listing page (maybe?)</li>\n<li><s>Get rid of &quot;/blog/&quot; as the first link in the listing</s></li>\n</ul>\n",
      "date_published": "2022-08-08T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/disappointing/",
      "url": "http://mikepropst.com/blog/disappointing/",
      "title": "Disappointing",
      "content_html": "<p>At least once a year we try to get out to Cape Disappointment on Washington's Long Beach Peninsula. It's a beautiful state park where the Columbia meets the ocean. Good to get that sea air.</p>\n<p><img src=\"http://mikepropst.com/img/cape.jpg\" alt=\"Lighthouse\" /></p>\n",
      "date_published": "2022-07-26T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/dark-days-ahead/",
      "url": "http://mikepropst.com/blog/dark-days-ahead/",
      "title": "Dark days ahead",
      "content_html": "<p>I wish I had any idea what to do. The dems' plan is &quot;vote!&quot; but they don't even really <em>win</em> when they win. So now what?</p>\n",
      "date_published": "2022-06-26T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/rip-julee-cruise/",
      "url": "http://mikepropst.com/blog/rip-julee-cruise/",
      "title": "RIP Julee Cruise",
      "content_html": "<p>Not much else to say. An iconic voice inextricably tied to something I love, though her feelings on that were mixed.</p>\n<div class=\"embed-container\"><iframe src=\"https://www.youtube.com/embed/uKDetywgLb4\" frameborder=\"0\" allowfullscreen=\"\"></iframe></div>\n",
      "date_published": "2022-06-11T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/rip-dave-smith/",
      "url": "http://mikepropst.com/blog/rip-dave-smith/",
      "title": "RIP Dave Smith",
      "content_html": "<p>Less than 3 weeks after making an appearance at Superbooth and looking healthy and enthusiastic, Dave Smith is dead at 72.</p>\n<p>If you don't know who he is, Smith is a synth pioneer who founded Sequential Circuits in the 70s. They made a lot of iconic synths but were most famous for the Prophet 5, pretty much the first programmable polyphonic synth. It really has yet to be topped, which is probably why the re-built company is still making a Prophet 5.</p>\n<p>Then, in the early 80s he conceived of and developed a universal interface for synthesizers from different manufacturers to talk to each other. Whether the fact that it's still in use today is evidence of its effectiveness or of how out-of-date it is now, you can't argue that MIDI is one of the most important things to happen in the world of music since the development of the synthesizer itself. He and Roland founder Ikutaro Kakehashi (also sadly no longer with us) even received a Grammy for the development of MIDI.</p>\n<p>For those of us who might never afford a Prophet, MIDI is the great unifier. Since its inception, it has allowed the fanciest Oberheim, the lowliest Volca, your SP-404 loaded with samples of farts, whatever it is, to talk to each other. The standard even continues into the computer, where I can download MIDI files of Clyde Stubblefield playing drums and replace all the hits with sounds of dogs barking or car crashes. I'm sure that's exactly what Smith had in mind.</p>\n<p>And speaking of that, one of Smith's other ventures was the first real software synth, Reality. Though he didn't ultimately care for making music inside a computer, it's another project he spearheaded that pretty much changed music forever.</p>\n<p>So the only thing left to say is thanks. You'll be missed.</p>\n",
      "date_published": "2022-06-03T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/yes-virginia-there-is-a-microsoft-version-of-that/",
      "url": "http://mikepropst.com/blog/yes-virginia-there-is-a-microsoft-version-of-that/",
      "title": "Yes, Virginia, there is a Microsoft version of that",
      "content_html": "<p>It can be tough when you're stuck in Windows world, with security lockdowns on your computer and a ban on most cloud services. With the notable exceptions of UserZoom, Figma, and Overflow, I'm in MS world and that's been an adjustment after the world of Google Apps and other lightweight, web-based tools.</p>\n<p>There's a benefit to being entirely in Microsoftland, or at least in theory there is. Kinda looks like with the advent of <a href=\"https://www.microsoft.com/en-us/microsoft-loop?ms.url=microsoftcommicrosoft-loop\">Loop</a> they are trying to make good on that theory and put it into real practice.</p>\n<p>So to say that Loop is a Notion ripoff seems partially true. But for those of us stuck here in Office 365 with no hope of using the real thing, that's totally <em>fine</em>. Just like Planner is not Trello and Todo isn't quite what Wunderlist was, and Power Automate is far from being as easy to work as IFTTT or Zapier — but they exist. I can imagine a lightweight database table like what Notion employs would be so much easier for many of the small tasks where I'm using SharePoint Lists. But the &quot;components&quot; feature of Loop seems to be where MS are really trying to take it a bit further.</p>\n<p>The idea behind components seems to be that the pieces of functionality (like Notion blocks?) are available elsewhere in the Office ecosystem: Teams chats, Word docs, email messages. And that's the kind of interoperability that we really don't enjoy today, even though that should be a prime selling point of Microsoftland. Mail Merge isn't exactly the future. But maybe Loop will be?</p>\n",
      "date_published": "2022-05-09T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/lite-xl/",
      "url": "http://mikepropst.com/blog/lite-xl/",
      "title": "Lite XL",
      "content_html": "<p>Love the <a href=\"https://lite-xl.com/\">contradictory name</a>. I don't necessarily want to get on the Electron hate train, but when you see the speed at which this thing fires up (much faster than VSCode, faster than GEdit, even) you might consider ditching Atom. It strikes a nice balance of features and performance.</p>\n",
      "date_published": "2022-04-23T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/yes-this-etc/",
      "url": "http://mikepropst.com/blog/yes-this-etc/",
      "title": "Yes, this, etc.",
      "content_html": "<p>My quest for simplicity has led to some people doing some pretty interesting stuff. Even more appealing to me than Utopia is <a href=\"https://every-layout.dev/\">Every Layout</a>, which frankly seems hard to sum up in an elevator pitch, but like Utopia it aims to get CSS back to declaration and away from prescription. In this case, it seems largely because declarative just <em>works better</em>. My only beef with this thing is the price. It's no doubt that a lot of work went into it but 70 bucks is steep.</p>\n<p>The further I read into the sample content, the more I'm standing up, punching the air, screaming. It's that invigorating and it makes that much sense.</p>\n<p>Incidentally, one of the authors is responsible for <a href=\"https://cube.fyi/\">CUBE CSS</a>, which I'm been looking at with interest too. I'm a BEM-head from way back, but this looks like an interesting philosophical take on CSS that embraces a recent trend among true HTML/CSS folks: <strong>Stop fighting the cascade.</strong> You're speaking my language.</p>\n",
      "date_published": "2022-04-22T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/365-days-of-type/",
      "url": "http://mikepropst.com/blog/365-days-of-type/",
      "title": "365 days of type 9 from TRUF",
      "content_html": "<p>I don't think much about cool typefaces these days, I'm generally just looking for something readable and pleasant for UIs and websites. But I still get a kick out of my favorite subject from school. <a href=\"https://www.thisiscolossal.com/2022/04/truf-36-days-of-type/\">This is really beautiful.</a></p>\n",
      "date_published": "2022-04-19T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/another-day-another-blog-redesign/",
      "url": "http://mikepropst.com/blog/another-day-another-blog-redesign/",
      "title": "Another day, another blog redesign",
      "content_html": "<p>Been thinking about doing this ever since I did the last one. It never quite came out the way I wanted and frankly, the newspaper-ish feel just didn't work. It worked in my head, and it sorta-kinda worked in Figma, and it just didn't translate.</p>\n<p>After reading about Utopia and thinking, hey maybe I should do that, I went a little deeper into the rabbit hole of simplicity.</p>\n<p>Some notes:</p>\n<ul>\n<li>There was no Figma phase to the &quot;design.&quot;</li>\n<li>I did this entirely live by mounting my website with <code>rclone</code> and editing live with GEdit (Atom couldn't browse and edit the remote files fast enough).</li>\n<li>There are 157 lines of CSS, un-minified, with a carriage return between each rule. It uses <strong>zero</strong> media queries. There aren't even any columns, so I didn't get the chance to evolve from flexbox to grid.</li>\n<li>I'm using CSS custom properties for the second time in my life, and though it doesn't give me everything I want from the Sass feature set, it's really great to get variables while staying native.</li>\n<li>I didn't quite leave the HTML unchanged, but I probably could've. I've been using almost the same HTML pretty much since I switched to Kirby many years ago.</li>\n<li>Standard posts have a larger first paragraph. This might possibly be inspired by <a href=\"https://gmi.skyjake.fi/lagrange/\">Lagrange</a>, the nicest Gemini client out there.</li>\n</ul>\n<p>I suppose I'll enjoy looking at this for a couple weeks and then off we go again, probably with a pendulum swing to complexity. Or maybe I'll just change that yellow to something else to tide me over for a bit.</p>\n",
      "date_published": "2022-04-13T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/utopian-thinking/",
      "url": "http://mikepropst.com/blog/utopian-thinking/",
      "title": "Utopian thinking",
      "content_html": "<p>Now <a href=\"https://utopia.fyi/\">this</a> is something interesting.</p>\n<p>Obviously we've gotten pretty far away from the fundamentals of the web. &quot;Text with hyperlinks&quot; is the mission of the <a href=\"https://gemini.circumlunar.space/\">Gemini project</a>, something that's described as heavier than Gopher and lighter than the web. So there's an appetite for those simpler days. All the myriad ways we've strayed from Hypertext's light would take quite a few more blog posts and sound like an old man yelling at clouds, but in terms of web design it feels pretty specific. Build tools. Compiled code. Scoping and renaming classes at runtime. Arguments about whether to put CSS in JS. Not gonna belabor that, you get it.</p>\n<p>I taught myself to ditch tables around 2002-2003 by reading Eric Meyer's O'Reilly title <em>CSS: The Definitive Guide</em>, which is purely a reference title. It was not what I would call complicated. It probably took me just as long to figure out how to implement Grunt, which was already supplanted by Gulp by that time. Life is complicated, and I guess life in CSS has gotten that way as well. It feels such a long way from the <a href=\"http://www.csszengarden.com/\">CSS Zen Garden</a>.</p>\n<p>I don't necessarily think that breakpoints and media queries are an extreme example of the complication — remember conditional comments? Remember writing separate sites from Netscape and Internet Explorer? But I do think Utopia's authors asserting that their framework is &quot;declarative&quot; instead of &quot;prescriptive&quot; or &quot;instructive&quot; brings it back to the fundamentals of CSS. I find it a bit ironic though that they're using some really complicated calculations to achieve simplicity for the user. I recognize that bootstrap does something similar when calculating the grid, but the deeper the math I don't understand burrows, the more scared I am of relying on it.</p>\n<p>I haven't read enough of the material here to understand how they handle anything other than the spacing and typography — and whether they like it or not, there is more to it than that, even if those are the only two things you <em>can't</em> take away. Looks like it may be relying on CSS grids to keep things in one media space. And lord knows I haven't adequately learned CSS grids yet. But I'm going to give this a shot. Maybe the next version of this site will be Utopian.</p>\n",
      "date_published": "2022-04-06T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/the-fbi-guide-to-internet-slang/",
      "url": "http://mikepropst.com/blog/the-fbi-guide-to-internet-slang/",
      "title": "The FBI Guide to Internet Slang",
      "content_html": "<p>Pentagram does a <a href=\"https://www.itsnicethat.com/news/pentagram-the-fbi-guide-to-internet-slang-graphic-design-100322\">snarky thing with a fun type design</a>. Like Bierut, I wonder if any of these terms the FBI notes have ever been used by <em>anyone</em>. The idea of the document reminds me of the old <a href=\"https://archive.org/details/LawEnforcementGuideToSatanicCults1994VHSOccultHilarity\">Law Enforcement Guide to Satanic Cults</a>. Link is to the film but its print predecessor baffled me even in middle school.</p>\n<p>It speaks to the (uh, problematic) law enforcement mindset that there are dark forces and coded evils working in all corners of the world and they're the last bastion of defense against it. Too often those &quot;evil&quot; symbols are just non-WASP identifiers, and fear of youth comes from the same place — especially when so much of internet slang comes from AAVE and other non-white sources.</p>\n",
      "date_published": "2022-03-25T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/problems-i-m-glad-im-not-dealing-with/",
      "url": "http://mikepropst.com/blog/problems-i-m-glad-im-not-dealing-with/",
      "title": "Problems I&#39;m glad I&#39;m not dealing with",
      "content_html": "<p>Eric Meyer on the CSS Working Group's attempts to add conditionals to CSS. My most recent side project uses pure CSS with variables, which is a huge step toward me not caring about preprocessors anymore. With logic, the only things left are concatenation (probably solved already), and nesting syntax, which I find cleaner to go through later on. He's right though, as a Sass user I can easily see both sides of this argument and don't know what's right. But I know it's progress, and in my current way of thinking, more features in CSS is better. Because no matter how &quot;bloated&quot; you think it'll be, it's still better than having to use extra tools that aren't natively parsed by the web browser.</p>\n",
      "date_published": "2022-03-22T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/is-this-it/",
      "url": "http://mikepropst.com/blog/is-this-it/",
      "title": "Is this it?",
      "content_html": "<p><a href=\"https://www.framer.com/sites/\">Framer Sites</a> looks wild. Framer already generates pretty good HTML, and this seems to represent the final few pieces necessary to actually turn that into a functional website. And CMS features are coming soon? Finally someone's really coming for the king in a big way, for the first time since the king has been Figma.</p>\n<p>Is this finally The Thing we've been looking for? A design tool that builds websites visually, but in a real &quot;web-like&quot; way? That's been an unsatisfactory process since my first job using NetObjects Fusion (which apparently is better in itself these days, using CSS grid instead of the absolute positioning it employed almost 25 years ago). Frankly, potentially exciting, although these days — as in those days — it's fun to whip up some HTML to create a nice looking site. Still feels like alchemy to me.</p>\n",
      "date_published": "2022-03-10T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/i-salute-you-mmt-8/",
      "url": "http://mikepropst.com/blog/i-salute-you-mmt-8/",
      "title": "I salute you, MMT-8",
      "content_html": "<p>Few pieces of gear are, on their own, really inspiring. Even the worst gear has its merits, but even the best sounding stuff isn't enough to be a wellspring of creativity. Ableton Live comes to mind, as well as the truly unique Novation Circuit, a cheap groovebox with no screen that I love almost as much as a family pet.</p>\n<p>Lately I've been digging an old school piece of hardware that probably sounds the least likely to fall into this category. The <strong>Alesis MMT-8</strong> is technically not a sequencer, but an 8-channel MIDI &quot;recorder&quot; and playback machine. It really does work a lot like an 8-track tape machine, but with MIDI data instead of audio. That means that it can control up to 8 devices by either playing notes, triggering their own sequencers, sending program change, and transmitting CC data. It's become the central master of my setup, and though it has its faults, it's so refreshing to get away from the computer for real that I'm itching to get on with writing new music.</p>\n<p>It's a strange design that could only come out of the late 80s, like Knight Rider. It shares the lazer-zap shape with its brother the HR-16 (precursor to the <a href=\"http://mikepropst.com/blog/in-praise-of-the-alesis-sr-16\">most successful drum machine of all time</a>, as well as the strange flip-up panel on top that contains an abbreviated user manual. Oddly, that shape does have the advantage of fitting a Korg Volca really nicely.</p>\n<p>![Alesis MMT-8](/img/mmt8.jpg | url)</p>\n<p>The first &quot;issue&quot; with the machine is that it doesn't have a very accurate clock. It's slow by about a whole BPM. If you want to be tempo-accurate, you need something else to send the data. On its own though, it has a pretty solid clock, though it purely transmits what was recorded into it, so if you want some unique feel or timing with &quot;character&quot; you'll need to trigger other sequencers. I'm just dreading when I play a show and someone comes up to me to say &quot;I bet you thought you were playing at 74 bpm but that was really 73.&quot; They're out there. I'm sure of it.</p>\n<p>The one workflow issue it has is a lack of overdubbing. If, for instance, I want drums and hi hats to be on the same track, I have to play the whole mess at once. Potentially a challenge, and more or less impossible if I want some kind of CC data at the same time. So those have to go on different channels. That being said, I have yet to feel like I need more than 8 channels. And when I do, I'll probably just find another MMT for about a hundred bucks. It does have extremely detailed editing capability as long as you're willing to do it on a 2-line LCD screen with squishy rubber buttons.</p>\n<p>It's remarkably fast and intuitive once you're in there, and that has always been the most important thing to me in a creative tool. Get me punching in notes and feeling the song, not thinking about how a thing works. And it's rare to get that along with the immediacy of hardware.</p>\n<p>So, Alesis MMT-8, I salute you.</p>\n",
      "date_published": "2022-03-03T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/bob-moog-and-usability-heuristics/",
      "url": "http://mikepropst.com/blog/bob-moog-and-usability-heuristics/",
      "title": "Bob Moog and usability heuristics",
      "content_html": "<p><a href=\"https://uxdesign.cc/how-bob-moog-brought-usability-heuristics-to-the-electronic-synthesizer-a6797a3a9192\">Here's a rare intersection of my interests.</a> This is actually a great article for UX folks who don't know anything about synthesizers.</p>\n<p>The author makes the (accurate) argument that Bob Moog changed the game by hard-wiring some signal paths and abandoning the fully customizable cable-based routing of modular synths.</p>\n<p>This is essentially what Apple did in terms of UI as well that led to their early success:</p>\n<ol>\n<li>Preset the red routes.</li>\n<li>Enable other routes with some switches that are not part of the main UI.</li>\n<li>Just abandon the ability to do some things that most users won't need.</li>\n</ol>\n<p>That made Apple popular with artists, designers and musicians, just as the Model D became the first synth truly popular with a wide range of musicians. Sure, the Rick Wakemans (and Linus Torvalds) of the world might want more, but they have their complicated alternatives. For the rest of us, it was finally time to make music with synths. Just watch any gear-focused interview with John Foxx, Gary Numan, George Clinton, Rick Wright, you name it — the Model D hugely influenced their worlds so they could influence the rest of the world.</p>\n<p><img src=\"http://mikepropst.com/img/modeld.jpg\" alt=\"Minimoog Model D\" /></p>\n<p>This philosophy can still be controversial at times, as with GNOME 3 (which, incidentally, <a href=\"https://www.pcworld.com/article/2691192/how-gnome-3-14-is-winning-back-disillusioned-linux-users.html\">has become less loathed</a> in the years since its release), but in general the idea of solving for the 90% of users who don't need 50% of the features is considered an obvious one nowadays.</p>\n<p>Of course, modulars have seen a resurgence lately because once you're in deep you inevitably want to start making your own synths. But that hasn't stopped the steady stream of simplistic analog boxes like the Volca series or Behringer's slavish old-school synth imitations. Options are great, but menu diving is no fun and the quickest way to get a musician to love your instrument is to get them creating quickly.</p>\n<p>And this, as the article gets across pretty well, is what we should learn from Moog.</p>\n<p>Apple would've patented the pitch wheel though.</p>\n",
      "date_published": "2021-08-10T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/a-better-way-to-keep-notes/",
      "url": "http://mikepropst.com/blog/a-better-way-to-keep-notes/",
      "title": "A better way to keep notes",
      "content_html": "<p>I'm definitely not alone here but finding the perfect toolset is a slight neurosis of mine. And I thought I had it with <a href=\"http://mikepropst.com/blog/typora-for-windows\">Typora</a>, a flat, local markdown editor with a notebook view and cross-platform access. But along comes a reference to <a href=\"https://obsidian.md/\">Obsidian</a> — in our local Nextdoor of all places — and I feel finally ready to move things off Notion and out of the cloud.</p>\n<p><img src=\"http://mikepropst.com/img/obs_screenshot.png\" alt=\"Obsidian\" /></p>\n<p>Obsidian has a lot of great features on top of being a markdown notebook, including:</p>\n<ul>\n<li>web-less encrypted sync</li>\n<li>images</li>\n<li>CSS-based themes</li>\n<li>wiki-style internal linking</li>\n<li>a nifty graph of all the links</li>\n<li>mobile version</li>\n<li>plugin architecture with a very active community</li>\n</ul>\n<p>The one thing it lacks from Notion is a database, but increasingly I find that the kitchen-sink approach isn't working for me. I just want structured text with images, and I can go to LibreOffice Base or Airtable to organize data.</p>\n<p>Summary:</p>\n<p>Tags: tools,markdown,notes</p>\n<p>Posttype: editorial</p>\n<p>Postlink:</p>\n",
      "date_published": "2021-08-02T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/figma-organization-for-busy-designers/",
      "url": "http://mikepropst.com/blog/figma-organization-for-busy-designers/",
      "title": "Figma organization for busy designers",
      "content_html": "<p><strong>EDIT TO THIS POST: (link: <a href=\"https://help.figma.com/hc/en-us/articles/360038511413-Set-custom-thumbnails-for-files\">https://help.figma.com/hc/en-us/articles/360038511413-Set-custom-thumbnails-for-files</a> Figma has a much more native way of handling this now). It's pretty rad, try it out.</strong></p>\n<p>If you're like a lot of designers, especially young enthusiastic ones or possibly freelancers with time between projects, you love to organize and beautify your systems. I've made a new CSS theme for my markdown editor! I built a home page for my browser that beautifully links to my current projects and most common pages. Etc.</p>\n<p>One of the big offenders in the mess of my work life is the list of Figma projects. It'll always be preferable to the classic joke of <code>design_final_final_r2__final.sketch</code> that anyone still in pre-Figma world is probably still dealing with, but it can be rough on the eyes.</p>\n<p>I came up with something that works well for me.</p>\n<ol>\n<li>Firstly, you <strong>have to give files a cover page</strong>.  Just do it. Mine use a frame that is 1240px x 660px.</li>\n<li>Each Figma project is actually a project category: Online banking designs, public web page designs,  internal software tools, customer journey maps, and libraries. Within those, each has its own style of cover page. This gives each listing page a unified feel and it's always obvious which list I'm looking at.</li>\n<li>I use the default gray background on the cover page, unless it's something I'm actively working on at the moment. Then I change it to green. This gives the cover a green border around it in the listing page.</li>\n</ol>\n<p><img src=\"http://mikepropst.com/img/figma_home.png\" alt=\"Figma\" /></p>\n<p>Create components for those covers in case you feel like you might want to change them down the road. Et voila, you've really simply gone from a mess in your projects list to an organized and legible design portal.</p>\n",
      "date_published": "2021-05-24T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/typora-for-windows/",
      "url": "http://mikepropst.com/blog/typora-for-windows/",
      "title": "Typora for Windows",
      "content_html": "<p>I've now been on Windows at work for 3 years and finally found a notes solution that seems to work. I have a weird set of requirements:</p>\n<ul>\n<li>I want it to look reasonably good if I'm looking at it all day</li>\n<li>It has to support Markdown</li>\n<li>It should support images</li>\n<li>It should have a &quot;notebook&quot; interface</li>\n<li>It can't use web sync because I work at a financial institution</li>\n<li>I can't run installers (unless they're single-user) because my work machine is locked down</li>\n</ul>\n<p>Finally, I found <a href=\"https://www.typora.io/\">Typora</a>. Insanely, it actually meets all these requirements, including a great notebook-style interface when you open an entire folder. Plus it has a few other features:</p>\n<ul>\n<li>Document outline</li>\n<li>Multiple themes (most of which aren't super great)</li>\n<li>Export into HTML, PDF and all kinds of other formats</li>\n</ul>\n<p>If you're on Windows or Linux, give it a shot. It's on Mac OS as well, but Mac users have such a glut of great markdown editors and notebooks (Bear and Byword are still among my favorites) that I'm not sure it's worth mentioning for them.</p>\n<p><em>Update: I have moved away from Typora in favor of a complete knowledgebase approach of Obsidian, which is far more of a &quot;notebook.&quot; Plus Typora has a cost and I can't buy stuff like this for my work machine.</em></p>\n",
      "date_published": "2021-05-05T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/the-great-un-googling/",
      "url": "http://mikepropst.com/blog/the-great-un-googling/",
      "title": "The great un-googling",
      "content_html": "<p>They said it couldn't be done — removing yourself from Amazon. In truth, it mostly can't. If you use almost any web-based service, you're using AWS. And if you're like me, stretched out across multiple different platforms, you probably use some of those. But we stopped shopping there, I got a Kobo, and we're on the way to replacing our smart speaker. Honestly? Not that hard. Prime video is about the only true difficulty, especially since they have Star Trek</p>\n<p>So, riding high on this pseudo-victory, I have declared I'm going to remove Google from my life.</p>\n<h2 id=\"hashtag-goals\" tabindex=\"-1\">Hashtag #goals <a class=\"direct-link\" href=\"http://mikepropst.com/blog/the-great-un-googling/#hashtag-goals\" aria-hidden=\"true\">#</a></h2>\n<p>Here's the deal, though. I've read posts like this from people more tech-savvy and smarter than myself, and I don't think I can go that hard. It sounds... tough. I just want to stop depending on them, stop letting them see everything I do, and generally stop supporting them. There are so many reasons out there for doing so, but that's not what this is about. This is about a quest for alternatives to the company that practically wrote the book on doing stuff in the browser.</p>\n<h2 id=\"the-pieces\" tabindex=\"-1\">The pieces <a class=\"direct-link\" href=\"http://mikepropst.com/blog/the-great-un-googling/#the-pieces\" aria-hidden=\"true\">#</a></h2>\n<p>Once you start cataloging it, there's a lot. And some are just gonna have to slide, no doubt about it, but I'll get there eventually. Here's where I'm at with alternatives.</p>\n<ul>\n<li><strong>Gmail.</strong> I looked at Proton, which is great if you really want to get into the extremes of privacy, and a few others, before settling on <a href=\"http://fastmail.com/\">Fastmail</a>. Fastmail won out for its UI, pricing to storage ratio, and inclusion of a calendar. Some friends' recommendations sealed that deal. Fastmail also features alias boxes, which can send or receive mail, and those are helping me get rid of the numerous random Gmail boxes in addition to the main one.</li>\n<li><strong>Docs.</strong> At the end of the day, I so rarely need a word processor and almost any will work. My personal hangup about docs is that I usually want structure rather than WYSIWYG layouts. It's a big part of why I use <s>Notion</s> Obsidian and frankly in most cases I'll just publish a PDF out of there. I write my post drafts in there since it's Markdown. But Apple's Pages online and MS Word online are totally fine, and more recently I found the hosted version of open-source OnlyOffice. As a bonus, it's a great replacement for the aging and frustrating LibreOffice on the Linux desktop.</li>\n<li><strong>Sheets.</strong> When Google Sheets launched, it was insane. Zoho had done it, but not well, and that's about it. There are all kinds of great tools out there now that make a spreadsheet seem quaint, but sometimes you just need a spreadsheet. It's still the &quot;killer app.&quot; And the originator is still pretty good at it. <a href=\"http://excel.office.com/\">Excel</a> online is a little more computer-intensive, but it does the thing well and doesn't get into other stuff. Coda is a possibility, but the learning curve is steep, and I've seen recommendations for Airtable but as cool as it is (I use it for a few things) it's really a different animal. OnlyOffice wins again, for anything that needs more math and fewer relationships than I would handle with Airtable.</li>\n<li><strong>Drive.</strong> My god, it's full of storage. There are so many alternatives out there it's not even worth it. If you want to use the same provider as your docs or sheets, then go with Microsoft or Apple. If privacy is your main value, try <a href=\"http://pcloud.com/\">pCloud</a> or Mega. I've personally gone with pCloud because of its media capabilities and generous size (not to mention its charmingly rough edges and desktop Linux integration), but my eggs are well distributed among many baskets.</li>\n<li><strong>Photos.</strong> Unlike email, there just aren't a lot of low-cost storage options for photos. Flickr has been so fucked-with for so long since Yahoo! took over that I can't make heads or tails of where they're going with it, and most services (that aren't AMZ) are geared toward photographers, not regular folks backing up their stuff. So for now, I have nothing except redundant external drives and possibly a larger pCloud plan.</li>\n<li><strong>Chromebook.</strong> Obviously Google tracking your entire operating system is not super ideal. However, this was easier to resolve than I expected. <a href=\"https://github.com/dnschneid/crouton\">Crouton</a> makes it easy to install a Linux environment with xfce. I'm still tweaking but it's working pretty well, especially considering my Chromebook runs on a Rockchip, which I think is like an ARM?</li>\n</ul>\n<p>The world of technology used to be this way. We used the best provider for each service or application. The idea of going to a one-stop shop is relatively new. Yeah, it makes things simple, but if the price for turning computing devices into dead-simple consumer electronics is all my privacy, I'm going to try to roll my own life.</p>\n",
      "date_published": "2021-04-25T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/new-device-behringer-td-3/",
      "url": "http://mikepropst.com/blog/new-device-behringer-td-3/",
      "title": "New device: Behringer TD-3",
      "content_html": "<p>It's pretty safe to call Behringer &quot;much-maligned.&quot; Obviously they have a tendency to do the cheap imitation version of gear, and Uli seems like kind of a dick. But rather than Mackie mixers or random pedals, they've set their sights in the past decade on the unobtanium of electronic music stuff. The Minimoog, the ARP 2600, the 808. And one of the recent ones is the Roland TB-303.</p>\n<p>I picked one up on Reverb for under $100 shipped, so it's kind of hard to say no. It goes well with my other small, cheap desktop modules like the Volca series and Arturia Microbrute. It is, however, a bit flimsier feeling than the others. But I've been assured by some owners of the original that it was also a plastic box that you wouldn't want to drop from too far up.</p>\n<p><img src=\"http://mikepropst.com/img/td3.jpg\" alt=\"TD-3\" /></p>\n<h3 id=\"sounds\" tabindex=\"-1\">Sounds <a class=\"direct-link\" href=\"http://mikepropst.com/blog/new-device-behringer-td-3/#sounds\" aria-hidden=\"true\">#</a></h3>\n<p>So how does it sound? There are plenty of YouTube videos at this point, but more than any other piece of synth gear I have, it does One Thing. It does that thing right, though. There are two wave shapes, the saw and square, and simplistic filter controls that were meant for guitarists rather than subtractive synth experts to work. The TB-3 adds a nice distortion option that the 303 lacked, and it really helps the bass cut through a thicker mix. I almost never turn it off, especially on the square wave shape. There's also a little patch bay at the top that lets you do some very basic CV controls. I could probably sync the filter to the kick pattern of the Volca Beats or send gate info to the Microbrute arpeggiator, but I have yet to play with it.</p>\n<h3 id=\"sequences\" tabindex=\"-1\">Sequences <a class=\"direct-link\" href=\"http://mikepropst.com/blog/new-device-behringer-td-3/#sequences\" aria-hidden=\"true\">#</a></h3>\n<p>The one thing that I almost wish wasn't so authentic is the sequencer. It works by programming notes, then by going back and programming all their lengths, including rests and holds. You really have to plan out your patterns in advance before starting to punch buttons. Fortunately, you can switch the thing into pitch mode and send it notes from somewhere else, like Ableton Live or my Alesis MMT-8 sequencer.</p>\n<h3 id=\"summary\" tabindex=\"-1\">Summary <a class=\"direct-link\" href=\"http://mikepropst.com/blog/new-device-behringer-td-3/#summary\" aria-hidden=\"true\">#</a></h3>\n<p>Those folks who automatically won't buy Behringer aside (I get you), the TB-3 isn't a device for everyone. It only does one thing, and chances are it'll makes you think of acid house as soon as it starts playing. But if you need bass in your setup, you could do a lot worse than around a hundred bucks for something that can shake the floor.</p>\n",
      "date_published": "2021-04-25T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/adee-figma-a11y-testing-tool/",
      "url": "http://mikepropst.com/blog/adee-figma-a11y-testing-tool/",
      "title": "Adee - Figma a11y testing tool",
      "content_html": "<p><a href=\"https://www.figma.com/community/plugin/931280467863251825/Adee---Comprehensive-Accessibility-Testing-Tool\">This is pretty cool</a>. Figma core features and plugins continue to narrow the gap between designing and building.</p>\n",
      "date_published": "2021-03-29T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/creating-music-during-the-pandemic/",
      "url": "http://mikepropst.com/blog/creating-music-during-the-pandemic/",
      "title": "Creating music during the pandemic",
      "content_html": "<p>I suppose I was fortunate, really. My band's drummer, who also wrote maybe 70% of the guitar riffs, finished his PhD and left the country to go work in Switzerland. Writing out that sentence makes me realize he was the <em>really</em> fortunate one. But what I mean is, a lot of my musician friends had to deal with the fact that they couldn't get together during the pandemic. For better or worse, I didn't have a band anymore to worry about.  Fortunately, prior to 2020 I'd released about a dozen releases (between digital, CD and cassette) over the past 20 years that featured no other musicians but me. So I started to hit the shed.</p>\n<p>I've been a process musician for most of that time. Each project, each release, is the result of a way of working. It comes from being in the experimental world for so long. Now, even when I make something that I find enjoyable to listen to, it's still gonna be made via a specific process. And when I make something with that process, I tend to move on. But that kind of indulgence is tough for someone with kids and a day job. Movement doesn't happen quickly enough, and output is minimal.</p>\n<p>So I came up with the plan of forcing myself into the shed once a week, and I decided I wasn't going to come out of the shed until I had a finished song.  Talking it out with a friend, I realized this accomplishes a few things:</p>\n<ol>\n<li>It opens the throttle on that speed of progress. If you just &quot;play around&quot; once a week for a couple hours, you're not going to get anywhere for a long time. Validating an idea once a week gets you through the ruts and the familiar patterns and into new ideas sooner.</li>\n<li>It keeps you from being precious about polish and &quot;finish.&quot; The dumb truth of a piece of music or art is that it's finished when you say it is. <em>Bee Thousand</em> is just as &quot;finished&quot; as <em>Dark Side of the Moon</em>, and they're both classics of their space. One was made by a group of guys with infinite time and money, and the other was made by a drunk schoolteacher with kids.</li>\n<li>It makes you go with your gut. Maybe if I hadn't been doing this for close to 25 years, I wouldn't feel like the gut was a useful thing. But the gut has become experienced.</li>\n</ol>\n<p>I'm currently using this process to create new Various Reasons tunes, always with the further constraint that someday they can be recreated live, but the first work I did with a &quot;live band&quot; style and put onto Bandcamp as Mezzo Cortex.</p>\n<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=4022765204/size=large/bgcol=ffffff/linkcol=f171a2/tracklist=false/artwork=small/transparent=true/\" seamless=\"\"><a href=\"https://mezzocortex.bandcamp.com/album/a-litany-of-bad-news\">A Litany of Bad News by mezzo cortex</a></iframe>\n",
      "date_published": "2021-03-20T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/cranking-the-engine-back-up/",
      "url": "http://mikepropst.com/blog/cranking-the-engine-back-up/",
      "title": "Cranking the engine back up",
      "content_html": "<p>I think I'm going to maybe do some blogging again? I've always had trouble with writing in the blog because I feel like it should be about UX. I generally want to write about synths and studio stuff. It is what it is. I'm now officially Too Old to be concerned whether potential employers look at my portfolio, see my blog, and realize that I don't spend every waking hour thinking about designing software. Also, I'm not really looking.</p>\n",
      "date_published": "2021-03-20T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/can-ux-be-remote/",
      "url": "http://mikepropst.com/blog/can-ux-be-remote/",
      "title": "Can UX be remote?",
      "content_html": "<p>Jakob Nielsen answers a question that's on a lot of people's minds right now. Weird times we're living in.</p>\n<div class=\"embed-container\"><iframe src=\"https://www.youtube.com/embed/MG64QcjRL8c\" frameborder=\"0\" allowfullscreen=\"\"></iframe></div>\n",
      "date_published": "2020-04-13T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/boring-gear-post-pedalboard-layout/",
      "url": "http://mikepropst.com/blog/boring-gear-post-pedalboard-layout/",
      "title": "Boring gear post (pedalboard layout",
      "content_html": "<p><img src=\"http://mikepropst.com/img/pedalbored.jpg\" alt=\"Pedalboard\" /></p>\n<p>Like any mediocre guitarist, I spend a lot of time rethinking my tone and my pedalboard. Like any experimental musician who likes to turn guitars into other sounds, I spend a lot of time trying to balance versatility and ease of use. Nobody likes to tap dance one-footed, even if you can perform an entire symphony.</p>\n<p>Over the course of the last year, I've really landed on a layout that I like. In order of the signal chain, here it is.</p>\n<h3 id=\"boss-tu-2\" tabindex=\"-1\">Boss TU-2 <a class=\"direct-link\" href=\"http://mikepropst.com/blog/boring-gear-post-pedalboard-layout/#boss-tu-2\" aria-hidden=\"true\">#</a></h3>\n<p>Not much to say about this. Fancy tuners come around every once in a while, but for accuracy, visibility, and durability, it's hard to beat the classic Boss.</p>\n<h3 id=\"pepers-pedals-rad\" tabindex=\"-1\">Pepers Pedals RAD <a class=\"direct-link\" href=\"http://mikepropst.com/blog/boring-gear-post-pedalboard-layout/#pepers-pedals-rad\" aria-hidden=\"true\">#</a></h3>\n<p>This is a Rat pedal. Pretty simple. It's made by Tony Pepers in New Zealand, and when you buy his pedals they come with this amazing gummy candy that's only available there. There are standard Rat controls and a switch that changes the clipping mode from standard Rat to Turbo Rat, or removes the clipping altogether. Without clipping, it's decidedly less Rat-like but it's still a very hairy fuzz. I don't stack overdrives and distortions anymore. I just crank up a Rat.</p>\n<h3 id=\"morley-mini-volume\" tabindex=\"-1\">Morley Mini Volume <a class=\"direct-link\" href=\"http://mikepropst.com/blog/boring-gear-post-pedalboard-layout/#morley-mini-volume\" aria-hidden=\"true\">#</a></h3>\n<p>I love the size of this thing. I always put volume pedals after the distortion, even though I sometimes can't get total silence with it rocked down, because that way the tone doesn't change when I fade it up and down. I do waffle on whether to put it in front of or behind my preamp pedal.</p>\n<h3 id=\"joyo-british-sound\" tabindex=\"-1\">Joyo British Sound <a class=\"direct-link\" href=\"http://mikepropst.com/blog/boring-gear-post-pedalboard-layout/#joyo-british-sound\" aria-hidden=\"true\">#</a></h3>\n<p>Yes, this is 100% a ripoff, possibly a stolen board design, of the Tech 21 British pedal, and it's probably unethical to buy this or any Joyo pedal because even the original designs have been more or less funded by this kind of stuff. But damn, it cost me $20 and it helps add that throaty, low-midrange roar to my plain sounding solid state amp. Plus I can dial in just the right amount of gain so that even the clean tone has a tiny bit of breakup. That helps make my cleans a little softer on the attack and less obviously solid-state.</p>\n<h3 id=\"line-6-m5\" tabindex=\"-1\">Line 6 M5 <a class=\"direct-link\" href=\"http://mikepropst.com/blog/boring-gear-post-pedalboard-layout/#line-6-m5\" aria-hidden=\"true\">#</a></h3>\n<p>Line 6 is not exactly the most prestigious brand to put on your board, but this pedal is ridiculously useful for keeping said board from getting completely out of hand. I use it primarily for modulation and special effects. I currently use the M5 for the pitch detune effect at the end of &quot;We Are The Life of the Future,&quot; and for wah/filter during &quot;We Live Inside.&quot; Both of these use the M-Audio expression pedal that's plugged into it (another not-great brand but it's lasted longer than the Roland one I used to have). Beyond the tremolos, choruses, flangers and other modulators, there are some fun (if not super useful) synth sounds and other random effects. Any effect can have its settings changed with the expression, which makes it doubly useful. And it's true-bypass, so even if you're worried about Patented Line 6 Tone altering your signal, it's alright. Personally, I would never use the preamp and distortion sounds, they're just not that good, but for single-use sounds you don't want to add a whole pedal for... why not?</p>\n<h3 id=\"seymour-duncan-deja-vu\" tabindex=\"-1\">Seymour Duncan Deja Vu <a class=\"direct-link\" href=\"http://mikepropst.com/blog/boring-gear-post-pedalboard-layout/#seymour-duncan-deja-vu\" aria-hidden=\"true\">#</a></h3>\n<p>This is a little-known delay with a hugely useful feature set and a great, live-friendly layout. There's tap tempo that can be set to either delay at the exact tempo you press, or at measure divisions, e.g. you tap the quarter note but it'll delay on a dotted eighth. It has an analog circuit simulator (cuts a lot of highs out of the repeats) with variable modulation (warble, basically) and you can dial any combination between the digital and analog for a lot of tonal variation. You can switch between tails or true bypass (I usually leave tails on and it doesn't really suck tone at all). As a bonus, cranking the delay speed knob way over will give you a looper function.</p>\n<p>As if all that wasn't enough, you can plug a TRS into its &quot;insert&quot; jack and put a whole chain of effects there that will only effect the repeats. That's what the Boss PS-2 is doing there: adding either compounding delays or pitch shifts to the repeats. Insane possibilities.</p>\n<p>It's basically the best delay pedal I've ever used, and the right combination of simple and powerful.</p>\n<h3 id=\"catalinbread-topanga\" tabindex=\"-1\">Catalinbread Topanga <a class=\"direct-link\" href=\"http://mikepropst.com/blog/boring-gear-post-pedalboard-layout/#catalinbread-topanga\" aria-hidden=\"true\">#</a></h3>\n<p>I switch reverbs out sometimes but this one is too fun to leave at home. It's supposed to be an emulation of a Fender spring reverb unit. Yes, you can get some super wet Dick Dale sounds out of it. One of its more enjoyable features is that it's sensitive to volume and creates breakup as you feed it a louder signal. Made in Portland.</p>\n<h3 id=\"hotone-wally\" tabindex=\"-1\">Hotone Wally <a class=\"direct-link\" href=\"http://mikepropst.com/blog/boring-gear-post-pedalboard-layout/#hotone-wally\" aria-hidden=\"true\">#</a></h3>\n<p>I may never figure out how to pronounce Hotone, but the Wally is a great little looper. You can stack a lot of loops of different times, you can change their pitch after you've recorded, and change the output volume of the playback. Great features for a tiny pedal. Unfortunately with its single button it's complicated to control and you can't end a loop at an exact time. And believe it or not, for most boards it's actually a little too small. I can't manage to get enough Velcro on the thing to keep it from moving around, and there's nowhere to zip-tie it.</p>\n<h3 id=\"tc-voicelive-not-pictured\" tabindex=\"-1\">TC Voicelive (not pictured) <a class=\"direct-link\" href=\"http://mikepropst.com/blog/boring-gear-post-pedalboard-layout/#tc-voicelive-not-pictured\" aria-hidden=\"true\">#</a></h3>\n<p>The empty space usually has my vocal processor on it. This thing is basically just delays, but it has some sort of compression and possibly EQ in it because everything comes out of it sounding so polished. It was purchased by my bandmate from Mike Scheidt, so it's seen some action but it's really tough. Unlike many other vocal effects I've used, sound people do not hate it.</p>\n<h3 id=\"the-board\" tabindex=\"-1\">The Board <a class=\"direct-link\" href=\"http://mikepropst.com/blog/boring-gear-post-pedalboard-layout/#the-board\" aria-hidden=\"true\">#</a></h3>\n<p>The board itself is a handmade wooden job that a friend built at a custom size for a pretty meager amount of money. I painted and velcro'd it, and even though it doesn't have a case and the slats can be a bit weird for the odd form-factor pedals like the Deja Vu, it's solid and really does the trick. The power supply is hidden out of sight and I have been able to velcro-tie the extra cabling. I just need to get an angled plug into that Topanga...</p>\n",
      "date_published": "2019-07-15T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/when-you-have-to-do-a-focus-group/",
      "url": "http://mikepropst.com/blog/when-you-have-to-do-a-focus-group/",
      "title": "When you &quot;have&quot; to do a focus group",
      "content_html": "<p>Most UX researchers will parrot the line that focus groups are terrible, and even if they are parroting, they're right. Erika Hall, in <em>Just Enough Research</em>, calls focus groups &quot;research theater.&quot;</p>\n<p>But often, you'll find that budget and/or time constraints can manipulate your beautifully planned user research into a focus group. Is there anything you can do about it?</p>\n<p>As usual, Pentagram and other gatekeeping haters be damned, design thinking (or human-centered design) comes to the rescue. Co-design doesn't just mean working in cross-functional teams in your own organization, it means involving your users. If we truly believe that they know best, then why not involve them?</p>\n<p>About a year ago, I got access to a group of young people who were acting as an advisory board to a client. The client made e-learning modules for an urban teen market and we were building the interface and helping with their product design philosophy. The problem with this access was that not only were the kids biased — they had volunteered for the position and were paid a stipend — but when they got together they were effectively a focus group. All of them were smart and motivated, but they weren't always motivated to give the kind of feedback we needed, and we continued to see patterns of one person leading the group (a standard focus group behavior).</p>\n<p>Since we met them regularly, I started to give them homework. They put together mood boards and talked about the kinds of sites they regularly visited. Maybe they all colluded, but it didn't matter quite as much because it was an intentional collaboration on their part in this case.</p>\n<p>Then we eased into some design thinking exercises, and conducted a design studio workshop. I instructed them to think of the particular details of what made them frustrated with, apathetic to, or unable to operate the current layouts. Then they drew. Standard practice applies here:</p>\n<ol>\n<li>We were remote, but I instructed the moderators to give them sharpies so we didn't fall into the detailed drawing trap.</li>\n<li>The youth liaison to the company, as well as the product leader and another product manager, participated.</li>\n<li>The drawings were timeboxed, then presented and lightly critiqued as a group.</li>\n</ol>\n<p>They took pictures and sent them to us, and we did affinity mapping and more detailed analysis after the workshop.</p>\n<p>None of this is really rocket surgery, but it's worth mentioning that as long as you have the right participants, any user research should be considered useful and there's a lot of value in being able to &quot;make lemonade.&quot;</p>\n",
      "date_published": "2019-04-04T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/scott/",
      "url": "http://mikepropst.com/blog/scott/",
      "title": "Scott",
      "content_html": "<p>This one is tough. Mark Hollis recently passed, and that was difficult to process but in the musical sense he was already gone, having left a near-perfect legacy of forward-thinking avant-pop that to most people's minds invented post-rock.</p>\n<p>Scott Walker on the other hand, despite his age, was still fairly prolific, especially considering his attention to craft and detail.</p>\n<p>I can think of at least 4 moments where he defied expectations: Quitting teen idoldom to write music, <em>Scott 4</em>, his songs on <em>Nite Flights</em>, and <em>Climate of Hunter</em>, which really established the rest of his career. There was nothing else on earth like them. There was nobody on earth like <em>him</em>. And there never will be.</p>\n<div class=\"embed-container\"><iframe src=\"https://www.youtube.com/embed/G_NIop72vis\" frameborder=\"0\" allowfullscreen=\"\"></iframe></div>\n",
      "date_published": "2019-03-25T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/hopefully-the-last-word-on-design-thinking/",
      "url": "http://mikepropst.com/blog/hopefully-the-last-word-on-design-thinking/",
      "title": "Hopefully The Last Word on Design Thinking",
      "content_html": "<p><a href=\"https://www.subtraction.com/2018/04/02/in-defense-of-design-thinking-which-is-terrible/\">Khoi Vinh, a voice of reason, finally weighs in</a> on the debate with &quot;In Defense of Design Thinking, Which Is Terrible.&quot; Apparently he also thinks that most of the arguments against design thinking are anti-democratization.</p>\n<blockquote>\n<p>So when I consider design thinking, it matters less to me whether it leads to a lot of bad design or not. What matters to me is whether it helps broaden the language of design, if it helps expand the community of design, if it helps build a world that values and understands design better than it does today. If design thinking is making us more relevant to the world at large, leading non-designers to embrace the way designers think, then the net effect strikes me as positive.</p>\n</blockquote>\n",
      "date_published": "2018-12-18T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/programming-css/",
      "url": "http://mikepropst.com/blog/programming-css/",
      "title": "Programming CSS",
      "content_html": "<p><a href=\"https://adactio.com/journal/14574\">Here's Jeremy Keith</a> on the logic inherent in CSS, and putting in guardrails.</p>\n",
      "date_published": "2018-12-17T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/ideo-responds/",
      "url": "http://mikepropst.com/blog/ideo-responds/",
      "title": "IDEO responds",
      "content_html": "<p><a href=\"https://www.fastcompany.com/90257718/ideo-breaks-its-silence-on-design-thinkings-critics\">Following up on all the bad takes on design thinking</a> (some of which they published), Fast Co has a small interview with an IDEO partner about why everyone suddenly hates design thinking. Short answer: it's just a tool, and one that looks shiny enough that there are tons of people using it poorly.</p>\n",
      "date_published": "2018-10-31T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/pure-framework/",
      "url": "http://mikepropst.com/blog/pure-framework/",
      "title": "PURE Framework",
      "content_html": "<p><a href=\"https://measuringu.com/pure/\">This article</a> came out early last year, but PURE is a new-to-me usability evaluation method from Intel Security and the master of UX metrics, Jeff Sauro. I'm always looking for low-impact, low-cost ways of evaluating the usability of features before (or, god forbid, in lieu of) a full moderated test.</p>\n<p>In some cases, that can be done. Even if you're against the idea as a useful method on its own, it can point to the places that need to have full testing done on them. PURE is nice because a decently-trained person can do it without having to hold tons of heuristic guidelines in their head. And you get a pretty nice-looking chart result at the end.</p>\n<p><img src=\"http://mikepropst.com/img/example_pure.png\" alt=\"Example\" /></p>\n<p>I've created a spreadsheet that calculates up the scores, and some Figma components to build the chart. I think this might be the case I've been looking for to develop a tool for Figma using their API.</p>\n<p><a href=\"https://measuringu.com/wp-content/uploads/2016/05/CHI-pure2016.pdf\">Here's the full whitepaper.</a></p>\n",
      "date_published": "2018-10-16T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/design-thinking-considered-harmful/",
      "url": "http://mikepropst.com/blog/design-thinking-considered-harmful/",
      "title": "Design Thinking Considered Harmful",
      "content_html": "<p>Not long after the recent Fast Co <a href=\"https://www.fastcompany.com/90166804/design-thinking-is-b-s\">article by the bigtime Pentagram designer</a>  about how Design Thinking sucks, here's that bastion of both design and progressive thinking, the...  <a href=\"https://hbr.org/2018/09/design-thinking-is-fundamentally-conservative-and-preserves-the-status-quo\">Harvard Business Review</a>? The thing that the author is mad about does not seem to be the kind of design thinking that I have either implemented or learned.</p>\n<p>The whole point of &quot;human centered design&quot; is to eliminate the concept of the designer dictating from on high. The version the author refers to, where a holy anointed designer filters the input of the unwashed masses, is something I'm wholly against as well. After all, I went to a two-year for-profit design school. Iskander has the right idea: we should be democratizing design and acting on the bottom-up, boots-on-the-ground perspective that we get from users/customers/beneficiaries and from non-designers in our organization. Unfortunately, it feels to me like she's been given a tainted version of design thinking -- one that I think a lot of other people have also received.</p>\n<p>My cognitive dissonance here is that these articles written by people named Natasha can't both be true. Jen, highfalutin Pentagram partner, can't be right about design thinking usurping the dominance of designers like her while Iskander is simultaneously right about the methods actually maintaining that dominance.</p>\n<p>At the end of the day, design thinking is, as Iskander says, a dumbed-down scientific method. So to my mind, what you do with that hypothesize-and-test framework can be conservative (blarg), innovative (bleh), or serve people well, depending on your hypotheses, the makeup of your team, and the projects you're working on. Keep the tools in your toolbox, keep serving the people you're designing for, and you'll be fine.</p>\n",
      "date_published": "2018-10-09T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/familytronica/",
      "url": "http://mikepropst.com/blog/familytronica/",
      "title": "Familytronica",
      "content_html": "<p>I sat down with my son (5) and the Alesis Micron that is now anchoring my live set and we made a little track together. It was going to be called &quot;Disco Slash&quot; but for unknown reasons, he retitled it to the less inspiring &quot;Disco Party.&quot; I helped with the mechanics but all the sequencing is him.</p>\n<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/480442689&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true\"></iframe>",
      "date_published": "2018-08-22T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/making-heroes/",
      "url": "http://mikepropst.com/blog/making-heroes/",
      "title": "Making Heroes",
      "content_html": "<p>Here's cool video with Tony Visconti discussing the creation of &quot;Heroes,&quot; the title song of maybe the best of Bowie's Berlin albums. It's amazing just to hear the multi tracks — Fripp's brilliant feedback guitar, the crack band, and Bowie's vocal takes, which get written about a lot but prove his power when you hear them on their own.</p>\n<p>It'd be easy to take away that the era of true studio innovation with giant budgets and beautiful studios is mostly at an end so we'll never get great records like this anymore, but it's all there available to us. You could recreate so many of these things and more in your own house. The inspiration is what's important, and there's a lot of it in this video.</p>\n<div class=\"embed-container\"><iframe src=\"https://www.youtube.com/embed/9ClNGJXUWvk\" frameborder=\"0\" allowfullscreen=\"\"></iframe></div>",
      "date_published": "2018-07-14T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/synthesizin/",
      "url": "http://mikepropst.com/blog/synthesizin/",
      "title": "Synthesizin&#39;",
      "content_html": "<p>One of the more fun things about playing electronic music is figuring out how to perform live. To some people, Ableton Live and its external controllers made the question moot. And to a large number of others, Elektron’s highly playable devices have become the de facto way of low-impact performance design.</p>\n<p>But when you’re not interested in bringing out a computer and you don’t have nice Elektron stuff, creating a way to connect and perform on your equipment is a fun and sometimes ridiculous challenge.</p>\n<p>Various Reasons, for me, has always been about this. And usually it’s been a little too complicated and unreliable to make things easy to play. But discovering some of the features of my Alesis Micron has really opened up my options.</p>\n<h3 id=\"what-it-is\" tabindex=\"-1\">What it is <a class=\"direct-link\" href=\"http://mikepropst.com/blog/synthesizin/#what-it-is\" aria-hidden=\"true\">#</a></h3>\n<p>Today, my setup starts with the (non-pro) Arturia BeatStep, which mostly provides master clock but runs the sequence on a couple songs. It’s a fun way to run things because even though I can’t hard-wire a tempo to songs, the analog clock helps me go by “feel” a little bit.</p>\n<p>From there, the MIDI chain goes to the Micron, which can run a multi-track sequencer. Unfortunately, having multiple sequences in songs means holding down keys and moving your finger around. That’s fine in some cases, and in others I’ve adapted tunes to use the same bassline moved around in key. There can even be rhythms.</p>\n<p>In theory, a whole song can be built on the Micron, but I consider my modded Alesis HR-16 to be a signature part of my sound. So that is next in the chain. The snare runs to a cheap delay pedal to help alter sounds and add dubby effects to the beats. From there, I send MIDI clock to my Arturia Microbrute, which is almost always running an arpeggiator timed to that clock. It goes through a preamp for distortion and a Catalinbread spring reverb.</p>\n<p>The last piece is a Korg Volca Keys. I use it for pads, leads, and with\nthe aid of a Hotone Wally looper, transitions between songs for less awkward silence while I change patches. The hardest part of this is hitting keys, but I don’t have a small enough MIDI controller to justify bringing out something else.</p>\n<p><img src=\"http://mikepropst.com/img/vrsrsns.jpg\" alt=\"Setup\" /></p>\n<p>It’s not the simplest setup I have. There are quite a few connections, and a couple analog synths with no patch recall. It does make changing parts within songs much easier than my previous setup, which had me running around like a crazy person trying to change patterns on multiple sequencers — some of which require two fingers. It’s got a bit of a shambolic timing, which is not ideal in some cases, but a lot more interesting and unique than a perfect computer or Octatrack clock. An audience member described it as “raw,” but to excerpt some of the lyrics, it’s also a mess of tangled wires.</p>\n",
      "date_published": "2018-04-10T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/reapin/",
      "url": "http://mikepropst.com/blog/reapin/",
      "title": "Reapin&#39;",
      "content_html": "<p>In the quest for audio perfection, I've found myself trying yet another tool.</p>\n<p>This time it was thanks to a mastering project — at the end of the day I still ended up doing mastering in DSP-Quattro, an unreliable piece of software that nevertheless is a dedicated mastering DAW. When you need things like crossfades, effects on regions, and DDP export... you need them. It's another 300 bucks to upgrade Studio One to the version that has a mastering workflow, so guess who isn't doing that? I'm continually frustrated by DSP-Quattro's odd workflows and constant crashing, but it does the job eventually.</p>\n<p>In the meantime, though, I gave REAPER a shot at it. If you're not familiar, Reaper (it's an acronym but I get really tired of capitalizing it) is a constantly-developing DAW that carries a $60 price tag for amateurs and $225 for pros. My impression of Reaper has always been that it's a technician's tool or &quot;computer person&quot; version of a DAW. That is to say, kind of the opposite of Pro Tools's heavy mimicry of a console-based workflow. One thing that its proponents are always fond of pimping is the customization. Reaper can, within reason, work any way you want it to, but there's a massive learning and setup curve to get there.</p>\n<p>Or maybe not. Turns out, it isn't that hard to do a lot of the customizations that force Reaper to work the way you want to work, from tool behavior to making F3 toggle the mixer like Pro Tools.</p>\n<p>It also sounds at least as good as Studio One, and has a much cleaner, more native-feeling interface than it used to. And I think that the the &quot;computer-like&quot; focus of the UI as opposed to slavish console worship is actually a strength. There are no audio or MIDI tracks, just <em>tracks</em>, and there are no groups, VCAs, or busses. Every track can be anything, so it supports an &quot;as you go&quot; creative workflow. Takes and playlists work easily.</p>\n<p>The shortcoming that most DAWs run up against versus Pro Tools is always audio editing, so that remains to be seen.</p>\n<p>I'm going to continue any client work that comes along in Studio One, but try the next <a href=\"http://anemptyroom.net/\">An Empty Room</a> recording with Reaper and see how it goes.</p>\n",
      "date_published": "2017-11-08T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/no-need-for-abstraction-layers-with-css-grid/",
      "url": "http://mikepropst.com/blog/no-need-for-abstraction-layers-with-css-grid/",
      "title": "No need for an abstraction layer with CSS Grid",
      "content_html": "<p>Rachel Andrew, the Guru of Grids, on <a href=\"https://rachelandrew.co.uk/archives/2017/07/01/you-do-not-need-a-css-grid-based-grid-system/\">why you don't need a &quot;Grid Framework&quot; to use CSS Grid</a>. For me, part of the desire to use grid is right here — the additional overhead of throwing in a grid system is just unnecessary. And with Grid comes horizontal and vertical alignment, markup without containers, and so many more possibilities for layout.</p>\n<p>Even fallbacks, one reason frameworks tend to get popular, aren't needed in her estimation:</p>\n<blockquote>\n<p>Create solid markup, uncluttered by additional elements that the past tells you that you need. Design your site using what Grid and other new methods have to offer. Then look at how you deal with the browsers without support, by serving them something slightly simpler.</p>\n</blockquote>\n<p>Now that Edge fully supports Grid, it's probably time to stop farting around and really learn it, now that I've finally embraced flexbox.</p>\n<p>date:</p>\n",
      "date_published": "2017-10-30T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/the-golden-age-of-ux/",
      "url": "http://mikepropst.com/blog/the-golden-age-of-ux/",
      "title": "Is the golden age of UX really over, and what does that really mean",
      "content_html": "<p>Maybe the &quot;golden age of UX&quot; <a href=\"https://blog.marvelapp.com/golden-age-ux/\">really is over</a>. I think a better way to put it is that we've been discovered out here in our clubhouse and now we're gonna have to grow up and play ball with everyone else. But this widely-shared article from Marvel (a tool I like a lot) has missed the mark in a couple fundamental ways.</p>\n<p>First, strategy is not for everyone. We did what I think is a great job designing strategy at D&amp;B, and it was in itself a design challenge. But not everyone on the team was involved or wanted to be involved. Disparaging non-strategic UX as a &quot;production&quot; role is an insulting mistake. This is skilled practitioner stuff, and there are <em>still</em> very few people who are actually good at it. The fact that there are exponentially more UX designers out there doesn't mean there are infinitely more good ones, especially since new folks are being raised on hot takes. So trying to convince the relatively few good ones to move on to strategic roles in companies that still need their user advocacy is not gonna help those companies.</p>\n<p>Especially if your next aim is to get those designers on the growth or marketing trains.</p>\n<p>&quot;Growth hacking&quot; is what UX designers are destined for now? Or social media marketing? Turn me into glue now, then, thanks. UX efforts are necessary in all of these worlds, and product marketing is inextricably tied to product design — but the core tenets of UX are unaffected by Valley trends (like &quot;growth hacking&quot;) or marketing efforts, which are famous for attempting to <em>subvert</em> the true needs of the user.</p>\n<p>Let's not lose the voice of the user in an attempt to stay relevant to a fad-driven Product Hunting world. And if the going wisdom is &quot;we solved that, time to move the talented designers on to growth hacking and marketing,&quot; then I'd consider that all the more reason why UX is still badly needed on the ground.</p>\n",
      "date_published": "2017-08-24T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/on-mistral/",
      "url": "http://mikepropst.com/blog/on-mistral/",
      "title": "On Mistral",
      "content_html": "<p>I think <a href=\"https://magenta.as/forget-comic-sans-mistral-is-the-typeface-you-should-love-to-hate-de799d9ea897\">the article itself</a> disproves the thesis that Mistral is patently hateable— in fact the piece eased my own distaste for it. I am plenty old enough to remember a time before Comic Sans and Papyrus when Mistral was the only typeface to loathe.</p>\n<p>One point that I think is key is that it was one of the few extant fonts, let alone ones that business owners had access to, that would approximate handwriting or graffiti. It's a big reason Comic Sans persists, and presumably why sites like Creative Market are flooded with handwritten custom typefaces. I find it hard to hate on small business owners who wanted their signs or truck stickers to be less brutalist. A world where an otherwise solid piece of art like <em>Straight Outta Compton</em> can be packaged in crap design is a more fun world, anyway.</p>\n",
      "date_published": "2017-08-01T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/stealing-your-way-to-original-design/",
      "url": "http://mikepropst.com/blog/stealing-your-way-to-original-design/",
      "title": "Stealing your way to original design with Dan Mall",
      "content_html": "<p>Mall is a capable, arguably influential designer and writer on the web. It's always cool to see how the sausage is made, but even cooler to see that a person with his credentials has <a href=\"https://danmall.com/posts/stealing-your-way-to-original-designs/\">a framework</a> for creative &quot;theft&quot; as a basis for starting new designs.</p>\n<p>When you're experienced, you start to internalize these kinds of layout patterns. But while recently working on a website, I realized I hadn't designed one in a very long time and was pretty unfamiliar with the nuts and bolts of a site these days. This would've been a great way to get rolling, and I might try it for the next iteration.</p>\n",
      "date_published": "2017-07-05T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/inline-validation-considered-harmful/",
      "url": "http://mikepropst.com/blog/inline-validation-considered-harmful/",
      "title": "Inline validation considered harmful",
      "content_html": "<p>Just kidding, <a href=\"https://medium.com/simple-human/inline-validation-is-problematic-399dd01d436f\">this article</a> didn't really use that word. And rather than an alarmist view, this is a fairly measured take. However, most of the arguments are actually against <em>realtime</em> (onblur) validation, not <em>inline</em> validation.</p>\n<p>I spent two years dealing with some serious problems that were born entirely out of the fact that an application used realtime+inline validation. And that was primarily in a series of wizard-like dialogs, which really didn't make any sense (the pattern of &quot;disable the continue button until validation is cleared&quot; would've worked well).</p>\n<p>Our problems included:</p>\n<ul>\n<li>forms that didn't require a certain order to filling them out, but validation that did</li>\n<li>false positives triggered by mouse actions that left users in an unresolvable state if they clicked &quot;wrong&quot;</li>\n<li>field groups often in a false-positive state (point #4 in the article)</li>\n</ul>\n<p>This isn't the same as saying that <em>per-field</em> validation is wrong, and I still strongly believe in that, but this article has a lot of solid points.</p>\n",
      "date_published": "2017-06-28T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/type-on-the-web/",
      "url": "http://mikepropst.com/blog/type-on-the-web/",
      "title": "Type on the web",
      "content_html": "<p>Some great fundamentals <a href=\"https://css-tricks.com/equilateral-triangle-perfect-paragraph/\">here</a>. Other than the wide trend toward cranking the size that's been going on for a few years, really solid type work on the web is only recently coming into its own. It's kind of like when Khoi Vinh popularized grids a few years back; it made me wonder how many folks in this business have even studied design. I think it's great when people with more formal knowledge spread it to the web.</p>\n<p>When it comes to type though, it's only been recently that we've been able to have a real level of control over it.</p>\n",
      "date_published": "2017-06-11T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/juicero-teardown/",
      "url": "http://mikepropst.com/blog/juicero-teardown/",
      "title": "Juicero teardown",
      "content_html": "<p>An engineer shows, from an engineer's perspective, what we already know from a market and common-sense standpoint: <a href=\"https://blog.bolt.io/heres-why-juicero-s-press-is-so-expensive-6add74594e50\">The Juicero is idiotic.</a></p>\n",
      "date_published": "2017-05-01T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/switching-to-studio-one/",
      "url": "http://mikepropst.com/blog/switching-to-studio-one/",
      "title": "Switching to Studio One",
      "content_html": "<p>I recently worked to record my band's new EP, and decided to do something I don't normally have the opportunity to do when someone's paying me: I changed my DAW.</p>\n<p>Backstory: my Mac is starting to become inoperable due to the longstanding need for operating system updates. Recently Chrome decided it didn't like my version of Mac OS anymore. But if I start moving to the California editions, I have to switch to Pro Tools 12. And if you don't know what that means, imagine moving from Adobe CS to Creative Cloud. Yeah, I sunk a lot of money into Pro Tools and I'm not really into paying $25 a month or $300 for a year at this point.</p>\n<p>So, I pulled out some old You Might Think We're Sharks base tracks from our last session that never got overdubs, and finished <a href=\"https://soundcloud.com/soundofsharks/summer-moon\">&quot;Summer Moon&quot;</a> in Presonus Studio One, which I've been threatening to switch to for a while.</p>\n<p>It went well, so I recorded An Empty Room's new one on it as well. There are some tradeoffs, but overall it's just a better experience and I wish I'd done it sooner. One thing I missed from Cubase is that the music creation and mixing portions were well integrated. In recent years since dropping Cubase, I tend to compose in Ableton, then finalize and mix in Pro Tools. In Studio One, though it's obviously not the same as Ableton, I'm able to integrate composition, tracking, and mixing pretty well. That works for our workflow since we'll add synths and samples in the mix process after doing the tracking.</p>\n<p><strong>The Pros:</strong></p>\n<ul>\n<li>Native compatibility with my hardware, which is made by Presonus as well.</li>\n<li>Almost everything is faster. To send tracks to a bus, just select them all, right click, and select &quot;Create Bus from selected tracks.&quot; No more routing.</li>\n<li>Track presets and plugin groups (so you can save an entire chain of plugins that you use often).</li>\n<li>Stock EQ has a frequency analyzer.</li>\n<li>VSTs and AUs are invariably cheaper and more available than AAX.</li>\n<li>Comping is incredible. Just highlight each part of the take (&quot;Layer&quot; in Studio One) you want to promote and it's done.</li>\n<li>Fades are automatic (like Ableton), and they can be tweaked with bezier curves, as can automation.</li>\n<li>Dragging and dropping, in most cases, replaces menus and routing. Even importing audio files: just drag them in, and when you save the file Studio One asks if you want to copy the audio files to the project directory.</li>\n<li>As of version 3.4, there is a Smart Tool just like Pro Tools.</li>\n<li>Macros.</li>\n</ul>\n<p><strong>The Cons:</strong></p>\n<ul>\n<li>I miss the single-stroke keyboard shortcuts. Leaving the modifier keys behind always made me feel like my keyboard was transformed into a spaceship control center. There are a few in S1, but not as many.</li>\n<li>By that same token, keyboard focus is sometimes wobbly. You can search for plugins in the Insert/Send menus, which is amazing. But you can't reliably use the keyboard to select the one you find, and I end up selecting tracks, soloing them, etc.</li>\n<li>Audio stretching is unintuitive.</li>\n<li>No Beat Detective equivalent that I know of. I didn't use it that much anyway.</li>\n<li>Nothing like Xpand! in the Artist version, but I recently picked up the VST version for a buck.</li>\n<li>That's... about it.</li>\n</ul>\n<p>I'm currently using Artist Edition with the iPad remote and VST plugin support upgrades. Most of the features that I would love to have in Pro Edition are not things that Pro Tools even had, like the Arranger Track.</p>\n<p>Overall, it was a small curve, a relatively painless experience, and I didn't lose much for features. Certainly didn't lose any fun.</p>\n",
      "date_published": "2017-03-23T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/ikea-hacking-for-the-studio/",
      "url": "http://mikepropst.com/blog/ikea-hacking-for-the-studio/",
      "title": "IKEA hacking for the studio",
      "content_html": "<p>Any time that I spend recording these days tends to be remote, and mixing happens 100% in the box. So loading up the rack spaces in my mix desk with outboard gear doesn't make a lot of sense. Maybe it would if I had some rackmount synths, but I don't. I previously traveled to remote gigs in a giant <a href=\"http://www.guitarcenter.com/Odyssey/Carpeted-Combo-Mixer-Rack-Case-6-Space-1274115053698.gc\">Odyssey mixer case</a> with 9 spaces on top and 6 on the bottom. It's ridiculous, even after adding casters, and near-impossible to load into the truck without risk of a hernia.</p>\n<p>But even the smallest portable rack case is crazy expensive for my purposes. I'm not going on tour. I'll move it occasionally from recording location to studio and back, but it's never going &quot;on the road.&quot; So after looking around I finally found this <a href=\"http://www.instructables.com/id/8U-Rack-Case-From-IKEA-RAST-Table/\">simple &quot;IKEA hack.&quot;</a> Conveniently, the Rast table is 19&quot; wide on the inside and made of unfinished pine. Assembled as-is with some rack rails attached, it'll hold 6U worth of rack gear. But a slight modification lets it hold 8U. I added handles and a flourescent light in the back, spray painted it black, <em>et voila</em>, a stupid-simple case.</p>\n<p>With the bigger items like my ART preamp, there isn't a lot of horizontal room left, but if I ever did this again I think I'd move the rack rails a little farther inside so the knobs were more protected. And for <a href=\"http://www.ikea.com/us/en/catalog/products/44361109/\">$15 at IKEA</a>, I suppose I <em>could</em> make another attempt.</p>\n<p>Cost breakdown:</p>\n<ul>\n<li>IKEA Rast - $14.99</li>\n<li>Rack rails - $6.96 x 2</li>\n<li>Spray paint - $3</li>\n<li>Handles - $3 x 2</li>\n<li>Total: Under $45</li>\n</ul>\n<p>Closest thing I could find pre-made: <a href=\"http://www.sweetwater.com/store/detail/RK8\">$130</a></p>\n<p><img src=\"http://mikepropst.com/img/rack_case_sm.jpg\" alt=\"DIY rack\" /></p>\n<p>FYI, my el cheapo signal chain, from the bottom up:</p>\n<ul>\n<li><strong>BBE bass EQ and preamp.</strong> I dislike the Sonic Maximizer and the &quot;BBE Sound&quot; in general, but this thing will even out a crappy bass guitar and give it some sustain and punch.</li>\n<li><strong>ART Pro MPA II (Gold Edition) mic preamp.</strong> ART get no love, but their black 2U tube units (MPA, VLA, Channel) sell for under $200 and they sound good. The Gold Edition swaps tubes for a less hissy gain. I mostly use it on vocals, but if you have to record a guitar direct it'll give you real tube gain, which will make any plugin amp simulator sound that much more authentic.</li>\n<li><strong>dbx 266xs compressor.</strong> I believe the &quot;xs&quot; stands for &quot;extra shitty&quot; when it comes to dbx's model line, but honestly it's still a dbx compressor. Which means it's pretty transparent and easy to use as well. For vocals I'll dial in some light compression when recording, but it's useful as a limiter as well if that's all you need.</li>\n<li><strong>Symetrix 525 compressor.</strong> I guess these things were originally for radio (duck the music as the DJ talks) but the sound is pretty darn good; I tend to use it to fatten/lengthen the sound of snares. Symetrix compressors have the distinction of being ultra-cheap (now and forever) but somehow approved by the GearSlutz community as useful tools.</li>\n<li><strong>Presonus Firestudio Project.</strong> I now have two of these interfaces because they're that good. For the money, it's almost impossible to beat the Presonus stuff. Decent gain on the preamps (could be better for vocals but that's what the ART is for), low noise, and pretty configurable and versatile. Chaining two is a breeze and gives you 16 mic inputs and 10 stereo outputs for a good bit less than a grand. I have never actually done remote recording with all 16, but in theory you could do a pretty good sized band at once.</li>\n</ul>\n",
      "date_published": "2017-03-23T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/linting-html-with-css/",
      "url": "http://mikepropst.com/blog/linting-html-with-css/",
      "title": "Linting HTML with CSS",
      "content_html": "<p><a href=\"https://bitsofco.de/linting-html-using-css/\">This</a> is a really cool idea.</p>\n",
      "date_published": "2017-03-14T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/its-grid-time/",
      "url": "http://mikepropst.com/blog/its-grid-time/",
      "title": "It&#39;s grid time!",
      "content_html": "<p>Firefox and Chrome have now officially launched support for CSS grid. Months of saving Rachel Andrew talks in your Pocket account and saying &quot;I'll get to that soon, it won't be ready for a couple years anyway&quot; have finally paid off!</p>\n<p>I'm kind of stoked to get into it. Here's a <a href=\"https://css-tricks.com/getting-started-css-grid/\">CSS-Tricks primer</a>.</p>\n",
      "date_published": "2017-03-13T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/front-end-styleguides-by-anna-debenham/",
      "url": "http://mikepropst.com/blog/front-end-styleguides-by-anna-debenham/",
      "title": "Front End Style Guides by Anna Debenham",
      "content_html": "<p>I'm still pretty into design systems and style-guide driven design, and I'm encouraged that the faddish nature of the conversation around these methods is passing into general wisdom and best practice. But there's still a lot of knowledge that has yet to be put &quot;out there.&quot;</p>\n<p>Brad Frost and Anna Debenham, who co-hosted a podcast together last year, are two of the biggest public proponents to recently release books on the subject. Whereas Frost's focuses more on the &quot;why&quot; and the philosophy of style-guide-driven design, Debenham's is very much a &quot;how&quot; book.</p>\n<p>She first goes through some of the methodologies and techniques that help break designers of the nasty habit of designing by pages: style tiles, element collages, and component libraries. Then she covers the advantages of style guides.</p>\n<p>From there, it's all practical. She focuses most of the book on the step by step process of implementing your first style-guide-driven redesign or creation of a component library. Throughout, she answers questions that real people doing real things with real style guides are going to ask: how rigid should I be, what tools should I use, what about maintenance once it's built... etc.</p>\n<p>Overall, it's a short read but dense with useful, practical information from that rare breed — a developer who can write and explain concisely and clearly. If you've gotten on board the philosophical train of style guides but aren't sure where to start, it's a good buy at $8. <a href=\"http://www.maban.co.uk/projects/front-end-style-guides/\">Get it here.</a></p>\n",
      "date_published": "2017-01-13T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/people-are-bad-at-computers/",
      "url": "http://mikepropst.com/blog/people-are-bad-at-computers/",
      "title": "Nielsen: Computer skills are worse than you think",
      "content_html": "<p><a href=\"https://www.nngroup.com/articles/computer-skill-levels/\">Pretty bad</a>. Not meant to be depressing though, I don't think. The core thing here is that you can't assume people are like you. Which you should not be doing, anyway.</p>\n",
      "date_published": "2016-11-21T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/japanese-logos/",
      "url": "http://mikepropst.com/blog/japanese-logos/",
      "title": "Japanese logos",
      "content_html": "<p><a href=\"http://iinejapanesetrademarks.tumblr.com/\">These are great</a>. The Japanese are particularly  good at (or at least responsive to) character logos, as evidenced by the old classic <a href=\"https://oxidedesign.com/a-logo-obsession-confession/\">Mitsui OSK Lines logo</a> that you might've seen on a shipping container.</p>\n",
      "date_published": "2016-11-04T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/disenfranchised-by-bad-design/",
      "url": "http://mikepropst.com/blog/disenfranchised-by-bad-design/",
      "title": "Disenfranchised by bad design",
      "content_html": "<p>Oh yay. <a href=\"https://www.propublica.org/article/disenfranchised-by-bad-design\">The intersection of voter disenfranchisement and irresponsible design</a>, it's the perfect storm of my rage.</p>\n",
      "date_published": "2016-10-24T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/when-to-use-you-and-me-in-a-user-interface/",
      "url": "http://mikepropst.com/blog/when-to-use-you-and-me-in-a-user-interface/",
      "title": "When to use &quot;me&quot; and &quot;you&quot; in a user interface",
      "content_html": "<p><a href=\"https://medium.com/@jsaito/is-this-my-interface-or-yours-b09a7a795256\">This is a pretty good set of guidelines</a>. I usually set up rules for any given project; I can't say that I've ever really had a major guiding principle for how I'm going to do things.</p>\n",
      "date_published": "2016-08-13T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/dont-do-it-no-2137/",
      "url": "http://mikepropst.com/blog/dont-do-it-no-2137/",
      "title": "Don&#39;t Do It, No. 2137",
      "content_html": "<p><a href=\"http://pitchfork.com/thepitch/1110-why-viet-cong-have-changed-their-name-an-interview-with-frontman-matt-flegel/\">Don't name your band after the villains</a> if you don't have any idea what you're talking about. Further... if someone calls you on it, at least pretend you did know what you were doing at the time, otherwise you're just a tool. It's almost like #145, &quot;Don't pretend you don't understand why your use of Nazi imagery bothers everyone.&quot; (Hi Iceage).</p>\n",
      "date_published": "2016-08-01T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/ignore-some-user-feedback/",
      "url": "http://mikepropst.com/blog/ignore-some-user-feedback/",
      "title": "Ignore (some) user feedback",
      "content_html": "<p><a href=\"http://www.erickarjaluoto.com/blog/ignore-some-user-feedback/\">Good points here.</a> I think we're actually pretty good at this. We tally Zendesk feedback and periodically meet with customer service to see what's actually a problem and what is just the result of a few loud voices.</p>\n",
      "date_published": "2016-07-15T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/to-icon-or-not-to-icon/",
      "url": "http://mikepropst.com/blog/to-icon-or-not-to-icon/",
      "title": "To icon or not to icon",
      "content_html": "<p><a href=\"https://ia.net/know-how/on-icons\">Pretty comprehensive writeup</a> about the use of icons from the makers of iA Writer, one of the App Store's most popular overpriced minimalist writing apps.</p>\n<p>The long and short of it:</p>\n<ul>\n<li>Icons alone can't convey the meaning, causing usability issues</li>\n<li>Text labels without icons are dry and not compelling, which is a UI problem of its own (whether we like that fact or not)</li>\n<li>Both is almost always going to feel like a compromise</li>\n</ul>\n<p>So... everything is bad, more or less. They advise getting things right without icons in the IA and wireframing stage, then adding on the emotional component as part of UI design. Sound approach, but ultimately we're still left with icons as a <em>pretty good</em> solution that are still mostly unable to convey verbs and abstract concepts.</p>\n",
      "date_published": "2016-06-10T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/meaningful-css/",
      "url": "http://mikepropst.com/blog/meaningful-css/",
      "title": "Meaningful CSS (Basically, what he said)",
      "content_html": "<p>Here's Jonathan Snook with what is probably <a href=\"http://snook.ca/archives/html_and_css/more-meaningful-css\">a more measured response</a> than mine.</p>\n",
      "date_published": "2016-05-25T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/semantics-vs-objects/",
      "url": "http://mikepropst.com/blog/semantics-vs-objects/",
      "title": "Semantics vs Objects and other scary CSS animals",
      "content_html": "<p>I suppose it was only a matter of time. The backlash always appears. It's a pretty old argument to be honest, the idea of getting &quot;back to basics&quot; or &quot;using the web as it was meant to be used.&quot; But the reason that front end devs have gotten a bit away from <a href=\"http://alistapart.com/article/meaningful-css-style-like-you-mean-it\">these kinds of methods of styling</a> is that it doesn't support everything that everyone wants to do anymore.</p>\n<p>I'd still say that if you're making a website — even if you're working with atomic or styleguide-driven design — you're better off taking advantage of HTML elements, ARIA roles, and the cascade to style your site. But in the world of applications where structure is arbitrary and markup is not necessarily the most readable thing in the world (and guess what, this is often out of our hands), being reusable and &quot;bulletproof&quot; is more important to a lot of front end folks.</p>\n<p>It's funny because this debate appears just as I'm finally considering adopting BEM in a project. I love — and need— the idea of a self-contained piece of UI that I can drop anywhere. At its best, this is front-end methodology as UX improvement, because the consistency of those pieces of UI helps the overall experience. Even without that benefit, it aids in speed of dev. Embarrassingly, perhaps the main reason that I gravitated toward BEM is that I'm sick of figuring out what to call things as I place HTML elements on a page.</p>\n",
      "date_published": "2016-05-18T00:00:00Z"
    },{
      "id": "http://mikepropst.com/blog/new-impercept-ep/",
      "url": "http://mikepropst.com/blog/new-impercept-ep/",
      "title": "New Impercept EP",
      "content_html": "<p>I spent a lot of time a couple months back experimenting with the new version of Reaktor. It doesn't actually work on my studio computer because it requires Yosemite, so it was something I could handle while at home on my newer Macbook Air (which runs Reaktor surprisingly well). For a cover and the title, I blasphemed the only <a href=\"https://parvulusinfectus.bandcamp.com/album/the-mark-ov-force-unspoken\">Parvulus Infectus album</a> released while we were together. It's maybe inspired by Bowie's cover for <em>The Next Day</em>.</p>\n<p><a href=\"https://impercept.bandcamp.com/album/the-force-of-marcus-dont-speak-it\">Check it out here.</a></p>\n<p><img src=\"http://mikepropst.com/img/marcus.jpg\" alt=\"MARCUS\" /></p>\n<p>Have a listen, and maybe like <a href=\"http://facebook.com/impercept\">Impercept on Facebook</a> for more of my musical experiments that don't logically fit with one of my bands.</p>\n",
      "date_published": "2016-03-28T00:00:00Z"
    }
  ]
}
